apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_sensitive.h
/****************************************************************************
 * arch/xtensa/src/esp32s3/hardware/esp32s3_sensitive.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_XTENSA_SRC_ESP32S3_HARDWARE_ESP32S3_SENSITIVE_H
#define __ARCH_XTENSA_SRC_ESP32S3_HARDWARE_ESP32S3_SENSITIVE_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include "esp32s3_soc.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* SENSITIVE_CACHE_DATAARRAY_CONNECT_0_REG register
 * Cache data array configuration register 0.
 */

#define SENSITIVE_CACHE_DATAARRAY_CONNECT_0_REG (DR_REG_SENSITIVE_BASE + 0x0)

/* SENSITIVE_CACHE_DATAARRAY_CONNECT_LOCK : R/W; bitpos: [0]; default: 0;
 * Set 1 to lock cache data array registers.
 */

#define SENSITIVE_CACHE_DATAARRAY_CONNECT_LOCK    (BIT(0))
#define SENSITIVE_CACHE_DATAARRAY_CONNECT_LOCK_M  (SENSITIVE_CACHE_DATAARRAY_CONNECT_LOCK_V << SENSITIVE_CACHE_DATAARRAY_CONNECT_LOCK_S)
#define SENSITIVE_CACHE_DATAARRAY_CONNECT_LOCK_V  0x00000001
#define SENSITIVE_CACHE_DATAARRAY_CONNECT_LOCK_S  0

/* SENSITIVE_CACHE_DATAARRAY_CONNECT_1_REG register
 * Cache data array configuration register 1.
 */

#define SENSITIVE_CACHE_DATAARRAY_CONNECT_1_REG (DR_REG_SENSITIVE_BASE + 0x4)

/* SENSITIVE_CACHE_DATAARRAY_CONNECT_FLATTEN : R/W; bitpos: [7:0]; default:
 * 255;
 * Cache data array connection configuration.
 */

#define SENSITIVE_CACHE_DATAARRAY_CONNECT_FLATTEN    0x000000ff
#define SENSITIVE_CACHE_DATAARRAY_CONNECT_FLATTEN_M  (SENSITIVE_CACHE_DATAARRAY_CONNECT_FLATTEN_V << SENSITIVE_CACHE_DATAARRAY_CONNECT_FLATTEN_S)
#define SENSITIVE_CACHE_DATAARRAY_CONNECT_FLATTEN_V  0x000000ff
#define SENSITIVE_CACHE_DATAARRAY_CONNECT_FLATTEN_S  0

/* SENSITIVE_APB_PERIPHERAL_ACCESS_0_REG register
 * APB peripheral configuration register 0.
 */

#define SENSITIVE_APB_PERIPHERAL_ACCESS_0_REG (DR_REG_SENSITIVE_BASE + 0x8)

/* SENSITIVE_APB_PERIPHERAL_ACCESS_LOCK : R/W; bitpos: [0]; default: 0;
 * Set 1 to lock APB peripheral Configuration Register.
 */

#define SENSITIVE_APB_PERIPHERAL_ACCESS_LOCK    (BIT(0))
#define SENSITIVE_APB_PERIPHERAL_ACCESS_LOCK_M  (SENSITIVE_APB_PERIPHERAL_ACCESS_LOCK_V << SENSITIVE_APB_PERIPHERAL_ACCESS_LOCK_S)
#define SENSITIVE_APB_PERIPHERAL_ACCESS_LOCK_V  0x00000001
#define SENSITIVE_APB_PERIPHERAL_ACCESS_LOCK_S  0

/* SENSITIVE_APB_PERIPHERAL_ACCESS_1_REG register
 * APB peripheral configuration register 1.
 */

#define SENSITIVE_APB_PERIPHERAL_ACCESS_1_REG (DR_REG_SENSITIVE_BASE + 0xc)

/* SENSITIVE_APB_PERIPHERAL_ACCESS_SPLIT_BURST : R/W; bitpos: [0]; default:
 * 1;
 * Set 1 to support split function for AHB access to APB peripherals.
 */

#define SENSITIVE_APB_PERIPHERAL_ACCESS_SPLIT_BURST    (BIT(0))
#define SENSITIVE_APB_PERIPHERAL_ACCESS_SPLIT_BURST_M  (SENSITIVE_APB_PERIPHERAL_ACCESS_SPLIT_BURST_V << SENSITIVE_APB_PERIPHERAL_ACCESS_SPLIT_BURST_S)
#define SENSITIVE_APB_PERIPHERAL_ACCESS_SPLIT_BURST_V  0x00000001
#define SENSITIVE_APB_PERIPHERAL_ACCESS_SPLIT_BURST_S  0

/* SENSITIVE_INTERNAL_SRAM_USAGE_0_REG register
 * Internal SRAM configuration register 0.
 */

#define SENSITIVE_INTERNAL_SRAM_USAGE_0_REG (DR_REG_SENSITIVE_BASE + 0x10)

/* SENSITIVE_INTERNAL_SRAM_USAGE_LOCK : R/W; bitpos: [0]; default: 0;
 * Set 1 to lock internal SRAM Configuration Register.
 */

#define SENSITIVE_INTERNAL_SRAM_USAGE_LOCK    (BIT(0))
#define SENSITIVE_INTERNAL_SRAM_USAGE_LOCK_M  (SENSITIVE_INTERNAL_SRAM_USAGE_LOCK_V << SENSITIVE_INTERNAL_SRAM_USAGE_LOCK_S)
#define SENSITIVE_INTERNAL_SRAM_USAGE_LOCK_V  0x00000001
#define SENSITIVE_INTERNAL_SRAM_USAGE_LOCK_S  0

/* SENSITIVE_INTERNAL_SRAM_USAGE_1_REG register
 * Internal SRAM configuration register 1.
 */

#define SENSITIVE_INTERNAL_SRAM_USAGE_1_REG (DR_REG_SENSITIVE_BASE + 0x14)

/* SENSITIVE_INTERNAL_SRAM_CPU_USAGE : R/W; bitpos: [10:4]; default: 127;
 * Set 1 to someone bit means corresponding internal SRAM level can be
 * accessed by cpu.
 */

#define SENSITIVE_INTERNAL_SRAM_CPU_USAGE    0x0000007f
#define SENSITIVE_INTERNAL_SRAM_CPU_USAGE_M  (SENSITIVE_INTERNAL_SRAM_CPU_USAGE_V << SENSITIVE_INTERNAL_SRAM_CPU_USAGE_S)
#define SENSITIVE_INTERNAL_SRAM_CPU_USAGE_V  0x0000007f
#define SENSITIVE_INTERNAL_SRAM_CPU_USAGE_S  4

/* SENSITIVE_INTERNAL_SRAM_DCACHE_USAGE : R/W; bitpos: [3:2]; default: 3;
 * Set 1 to someone bit means corresponding internal SRAM level can be
 * accessed by dcache.
 */

#define SENSITIVE_INTERNAL_SRAM_DCACHE_USAGE    0x00000003
#define SENSITIVE_INTERNAL_SRAM_DCACHE_USAGE_M  (SENSITIVE_INTERNAL_SRAM_DCACHE_USAGE_V << SENSITIVE_INTERNAL_SRAM_DCACHE_USAGE_S)
#define SENSITIVE_INTERNAL_SRAM_DCACHE_USAGE_V  0x00000003
#define SENSITIVE_INTERNAL_SRAM_DCACHE_USAGE_S  2

/* SENSITIVE_INTERNAL_SRAM_ICACHE_USAGE : R/W; bitpos: [1:0]; default: 3;
 * Set 1 to someone bit means corresponding internal SRAM level can be
 * accessed by icache.
 */

#define SENSITIVE_INTERNAL_SRAM_ICACHE_USAGE    0x00000003
#define SENSITIVE_INTERNAL_SRAM_ICACHE_USAGE_M  (SENSITIVE_INTERNAL_SRAM_ICACHE_USAGE_V << SENSITIVE_INTERNAL_SRAM_ICACHE_USAGE_S)
#define SENSITIVE_INTERNAL_SRAM_ICACHE_USAGE_V  0x00000003
#define SENSITIVE_INTERNAL_SRAM_ICACHE_USAGE_S  0

/* SENSITIVE_INTERNAL_SRAM_USAGE_2_REG register
 * Internal SRAM configuration register 2.
 */

#define SENSITIVE_INTERNAL_SRAM_USAGE_2_REG (DR_REG_SENSITIVE_BASE + 0x18)

/* SENSITIVE_INTERNAL_SRAM_CORE1_TRACE_ALLOC : R/W; bitpos: [17:16];
 * default: 0;
 * Which internal SRAM bank (16KB) of 64KB can be accessed by core1 trace
 * bus.
 */

#define SENSITIVE_INTERNAL_SRAM_CORE1_TRACE_ALLOC    0x00000003
#define SENSITIVE_INTERNAL_SRAM_CORE1_TRACE_ALLOC_M  (SENSITIVE_INTERNAL_SRAM_CORE1_TRACE_ALLOC_V << SENSITIVE_INTERNAL_SRAM_CORE1_TRACE_ALLOC_S)
#define SENSITIVE_INTERNAL_SRAM_CORE1_TRACE_ALLOC_V  0x00000003
#define SENSITIVE_INTERNAL_SRAM_CORE1_TRACE_ALLOC_S  16

/* SENSITIVE_INTERNAL_SRAM_CORE0_TRACE_ALLOC : R/W; bitpos: [15:14];
 * default: 0;
 * Which internal SRAM bank (16KB) of 64KB can be accessed by core0 trace
 * bus.
 */

