apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_sensitive.h
#define SENSITIVE_INTERNAL_SRAM_CORE0_TRACE_ALLOC    0x00000003
#define SENSITIVE_INTERNAL_SRAM_CORE0_TRACE_ALLOC_M  (SENSITIVE_INTERNAL_SRAM_CORE0_TRACE_ALLOC_V << SENSITIVE_INTERNAL_SRAM_CORE0_TRACE_ALLOC_S)
#define SENSITIVE_INTERNAL_SRAM_CORE0_TRACE_ALLOC_V  0x00000003
#define SENSITIVE_INTERNAL_SRAM_CORE0_TRACE_ALLOC_S  14

/* SENSITIVE_INTERNAL_SRAM_CORE1_TRACE_USAGE : R/W; bitpos: [13:7]; default:
 * 0;
 * Set 1 to someone bit means corresponding internal SRAM level can be
 * accessed by core1 trace bus.
 */

#define SENSITIVE_INTERNAL_SRAM_CORE1_TRACE_USAGE    0x0000007f
#define SENSITIVE_INTERNAL_SRAM_CORE1_TRACE_USAGE_M  (SENSITIVE_INTERNAL_SRAM_CORE1_TRACE_USAGE_V << SENSITIVE_INTERNAL_SRAM_CORE1_TRACE_USAGE_S)
#define SENSITIVE_INTERNAL_SRAM_CORE1_TRACE_USAGE_V  0x0000007f
#define SENSITIVE_INTERNAL_SRAM_CORE1_TRACE_USAGE_S  7

/* SENSITIVE_INTERNAL_SRAM_CORE0_TRACE_USAGE : R/W; bitpos: [6:0]; default:
 * 0;
 * Set 1 to someone bit means corresponding internal SRAM level can be
 * accessed by core0 trace bus.
 */

#define SENSITIVE_INTERNAL_SRAM_CORE0_TRACE_USAGE    0x0000007f
#define SENSITIVE_INTERNAL_SRAM_CORE0_TRACE_USAGE_M  (SENSITIVE_INTERNAL_SRAM_CORE0_TRACE_USAGE_V << SENSITIVE_INTERNAL_SRAM_CORE0_TRACE_USAGE_S)
#define SENSITIVE_INTERNAL_SRAM_CORE0_TRACE_USAGE_V  0x0000007f
#define SENSITIVE_INTERNAL_SRAM_CORE0_TRACE_USAGE_S  0

/* SENSITIVE_INTERNAL_SRAM_USAGE_3_REG register
 * Internal SRAM configuration register 3.
 */

#define SENSITIVE_INTERNAL_SRAM_USAGE_3_REG (DR_REG_SENSITIVE_BASE + 0x1c)

/* SENSITIVE_INTERNAL_SRAM_MAC_DUMP_USAGE : R/W; bitpos: [3:0]; default: 0;
 * Set 1 to someone bit means corresponding internal SRAM level can be
 * accessed by mac dump.
 */

#define SENSITIVE_INTERNAL_SRAM_MAC_DUMP_USAGE    0x0000000f
#define SENSITIVE_INTERNAL_SRAM_MAC_DUMP_USAGE_M  (SENSITIVE_INTERNAL_SRAM_MAC_DUMP_USAGE_V << SENSITIVE_INTERNAL_SRAM_MAC_DUMP_USAGE_S)
#define SENSITIVE_INTERNAL_SRAM_MAC_DUMP_USAGE_V  0x0000000f
#define SENSITIVE_INTERNAL_SRAM_MAC_DUMP_USAGE_S  0

/* SENSITIVE_INTERNAL_SRAM_USAGE_4_REG register
 * Internal SRAM configuration register 4.
 */

#define SENSITIVE_INTERNAL_SRAM_USAGE_4_REG (DR_REG_SENSITIVE_BASE + 0x20)

/* SENSITIVE_INTERNAL_SRAM_LOG_USAGE : R/W; bitpos: [6:0]; default: 0;
 * Set 1 to someone bit means corresponding internal SRAM level can be
 * accessed by log bus.
 */

#define SENSITIVE_INTERNAL_SRAM_LOG_USAGE    0x0000007f
#define SENSITIVE_INTERNAL_SRAM_LOG_USAGE_M  (SENSITIVE_INTERNAL_SRAM_LOG_USAGE_V << SENSITIVE_INTERNAL_SRAM_LOG_USAGE_S)
#define SENSITIVE_INTERNAL_SRAM_LOG_USAGE_V  0x0000007f
#define SENSITIVE_INTERNAL_SRAM_LOG_USAGE_S  0

/* SENSITIVE_RETENTION_DISABLE_REG register
 * Retention configuration register.
 */

#define SENSITIVE_RETENTION_DISABLE_REG (DR_REG_SENSITIVE_BASE + 0x24)

/* SENSITIVE_RETENTION_DISABLE : R/W; bitpos: [0]; default: 0;
 * Set 1 to disable retention function and lock disable state.
 */

#define SENSITIVE_RETENTION_DISABLE    (BIT(0))
#define SENSITIVE_RETENTION_DISABLE_M  (SENSITIVE_RETENTION_DISABLE_V << SENSITIVE_RETENTION_DISABLE_S)
#define SENSITIVE_RETENTION_DISABLE_V  0x00000001
#define SENSITIVE_RETENTION_DISABLE_S  0

/* SENSITIVE_CACHE_TAG_ACCESS_0_REG register
 * Cache tag configuration register 0.
 */

#define SENSITIVE_CACHE_TAG_ACCESS_0_REG (DR_REG_SENSITIVE_BASE + 0x28)

/* SENSITIVE_CACHE_TAG_ACCESS_LOCK : R/W; bitpos: [0]; default: 0;
 * Set 1 to lock cache tag Configuration Register.
 */

#define SENSITIVE_CACHE_TAG_ACCESS_LOCK    (BIT(0))
#define SENSITIVE_CACHE_TAG_ACCESS_LOCK_M  (SENSITIVE_CACHE_TAG_ACCESS_LOCK_V << SENSITIVE_CACHE_TAG_ACCESS_LOCK_S)
#define SENSITIVE_CACHE_TAG_ACCESS_LOCK_V  0x00000001
#define SENSITIVE_CACHE_TAG_ACCESS_LOCK_S  0

/* SENSITIVE_CACHE_TAG_ACCESS_1_REG register
 * Cache tag configuration register 1.
 */

#define SENSITIVE_CACHE_TAG_ACCESS_1_REG (DR_REG_SENSITIVE_BASE + 0x2c)

/* SENSITIVE_PRO_D_TAG_WR_ACS : R/W; bitpos: [3]; default: 1;
 * Set 1 to enable Dcache write access tag memory.
 */

#define SENSITIVE_PRO_D_TAG_WR_ACS    (BIT(3))
#define SENSITIVE_PRO_D_TAG_WR_ACS_M  (SENSITIVE_PRO_D_TAG_WR_ACS_V << SENSITIVE_PRO_D_TAG_WR_ACS_S)
#define SENSITIVE_PRO_D_TAG_WR_ACS_V  0x00000001
#define SENSITIVE_PRO_D_TAG_WR_ACS_S  3

/* SENSITIVE_PRO_D_TAG_RD_ACS : R/W; bitpos: [2]; default: 1;
 * Set 1 to enable Dcache read access tag memory.
 */

#define SENSITIVE_PRO_D_TAG_RD_ACS    (BIT(2))
#define SENSITIVE_PRO_D_TAG_RD_ACS_M  (SENSITIVE_PRO_D_TAG_RD_ACS_V << SENSITIVE_PRO_D_TAG_RD_ACS_S)
#define SENSITIVE_PRO_D_TAG_RD_ACS_V  0x00000001
#define SENSITIVE_PRO_D_TAG_RD_ACS_S  2

/* SENSITIVE_PRO_I_TAG_WR_ACS : R/W; bitpos: [1]; default: 1;
 * Set 1 to enable Icache write access tag memory.
 */

#define SENSITIVE_PRO_I_TAG_WR_ACS    (BIT(1))
#define SENSITIVE_PRO_I_TAG_WR_ACS_M  (SENSITIVE_PRO_I_TAG_WR_ACS_V << SENSITIVE_PRO_I_TAG_WR_ACS_S)
#define SENSITIVE_PRO_I_TAG_WR_ACS_V  0x00000001
#define SENSITIVE_PRO_I_TAG_WR_ACS_S  1

/* SENSITIVE_PRO_I_TAG_RD_ACS : R/W; bitpos: [0]; default: 1;
 * Set 1 to enable Icache read access tag memory.
 */

#define SENSITIVE_PRO_I_TAG_RD_ACS    (BIT(0))
#define SENSITIVE_PRO_I_TAG_RD_ACS_M  (SENSITIVE_PRO_I_TAG_RD_ACS_V << SENSITIVE_PRO_I_TAG_RD_ACS_S)
#define SENSITIVE_PRO_I_TAG_RD_ACS_V  0x00000001
#define SENSITIVE_PRO_I_TAG_RD_ACS_S  0

/* SENSITIVE_CACHE_MMU_ACCESS_0_REG register
 * Cache MMU configuration register 0.
 */

#define SENSITIVE_CACHE_MMU_ACCESS_0_REG (DR_REG_SENSITIVE_BASE + 0x30)

/* SENSITIVE_CACHE_MMU_ACCESS_LOCK : R/W; bitpos: [0]; default: 0;
 * Set 1 to lock cache MMU registers.
 */

#define SENSITIVE_CACHE_MMU_ACCESS_LOCK    (BIT(0))
#define SENSITIVE_CACHE_MMU_ACCESS_LOCK_M  (SENSITIVE_CACHE_MMU_ACCESS_LOCK_V << SENSITIVE_CACHE_MMU_ACCESS_LOCK_S)
#define SENSITIVE_CACHE_MMU_ACCESS_LOCK_V  0x00000001
#define SENSITIVE_CACHE_MMU_ACCESS_LOCK_S  0

/* SENSITIVE_CACHE_MMU_ACCESS_1_REG register
 * Cache MMU configuration register 1.
 */

#define SENSITIVE_CACHE_MMU_ACCESS_1_REG (DR_REG_SENSITIVE_BASE + 0x34)

