apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_sensitive.h
/* SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_WORLD_1_AREA_0 : R/W; bitpos:
 * [1:0]; default: 3;
 * Region 0 permission in world 1 for core0.
 */

#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_WORLD_1_AREA_0    0x00000003
#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_WORLD_1_AREA_0_M  (SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_WORLD_1_AREA_0_V << SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_WORLD_1_AREA_0_S)
#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_WORLD_1_AREA_0_V  0x00000003
#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_WORLD_1_AREA_0_S  0

/* SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_3_REG register
 * Core0 region permission register 3.
 */

#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_3_REG (DR_REG_SENSITIVE_BASE + 0x16c)

/* SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_0 : R/W; bitpos: [29:0];
 * default: 0;
 * Region 0 start address for core0.
 */

#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_0    0x3fffffff
#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_0_M  (SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_0_V << SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_0_S)
#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_0_V  0x3fffffff
#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_0_S  0

/* SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_4_REG register
 * Core0 region permission register 4.
 */

#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_4_REG (DR_REG_SENSITIVE_BASE + 0x170)

/* SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_1 : R/W; bitpos: [29:0];
 * default: 0;
 * Region 0 end address and Region 1 start address for core0.
 */

#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_1    0x3fffffff
#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_1_M  (SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_1_V << SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_1_S)
#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_1_V  0x3fffffff
#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_1_S  0

/* SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_5_REG register
 * Core0 region permission register 5.
 */

#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_5_REG (DR_REG_SENSITIVE_BASE + 0x174)

/* SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_2 : R/W; bitpos: [29:0];
 * default: 0;
 * Region 1 end address and Region 2 start address for core0.
 */

#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_2    0x3fffffff
#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_2_M  (SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_2_V << SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_2_S)
#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_2_V  0x3fffffff
#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_2_S  0

/* SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_6_REG register
 * Core0 region permission register 6.
 */

#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_6_REG (DR_REG_SENSITIVE_BASE + 0x178)

/* SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_3 : R/W; bitpos: [29:0];
 * default: 0;
 * Region 2 end address and Region 3 start address for core0.
 */

#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_3    0x3fffffff
#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_3_M  (SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_3_V << SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_3_S)
#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_3_V  0x3fffffff
#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_3_S  0

/* SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_7_REG register
 * Core0 region permission register 7.
 */

#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_7_REG (DR_REG_SENSITIVE_BASE + 0x17c)

/* SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_4 : R/W; bitpos: [29:0];
 * default: 0;
 * Region 3 end address and Region 4 start address for core0.
 */

#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_4    0x3fffffff
#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_4_M  (SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_4_V << SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_4_S)
#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_4_V  0x3fffffff
#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_4_S  0

/* SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_8_REG register
 * Core0 region permission register 8.
 */

#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_8_REG (DR_REG_SENSITIVE_BASE + 0x180)

/* SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_5 : R/W; bitpos: [29:0];
 * default: 0;
 * Region 4 end address and Region 5 start address for core0.
 */

#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_5    0x3fffffff
#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_5_M  (SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_5_V << SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_5_S)
#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_5_V  0x3fffffff
#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_5_S  0

/* SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_9_REG register
 * Core0 region permission register 9.
 */

#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_9_REG (DR_REG_SENSITIVE_BASE + 0x184)

/* SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_6 : R/W; bitpos: [29:0];
 * default: 0;
 * Region 5 end address and Region 6 start address for core0.
 */

#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_6    0x3fffffff
#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_6_M  (SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_6_V << SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_6_S)
#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_6_V  0x3fffffff
#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_6_S  0

/* SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_10_REG register
 * Core0 region permission register 10.
 */

#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_10_REG (DR_REG_SENSITIVE_BASE + 0x188)

/* SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_7 : R/W; bitpos: [29:0];
 * default: 0;
 * Region 6 end address and Region 7 start address for core0.
 */

#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_7    0x3fffffff
#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_7_M  (SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_7_V << SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_7_S)
#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_7_V  0x3fffffff
#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_7_S  0

