apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_sensitive.h
/* SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_11_REG register
 * Core0 region permission register 11.
 */

#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_11_REG (DR_REG_SENSITIVE_BASE + 0x18c)

/* SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_8 : R/W; bitpos: [29:0];
 * default: 0;
 * Region 7 end address and Region 8 start address for core0.
 */

#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_8    0x3fffffff
#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_8_M  (SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_8_V << SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_8_S)
#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_8_V  0x3fffffff
#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_8_S  0

/* SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_12_REG register
 * Core0 region permission register 12.
 */

#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_12_REG (DR_REG_SENSITIVE_BASE + 0x190)

/* SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_9 : R/W; bitpos: [29:0];
 * default: 0;
 * Region 8 end address and Region 9 start address for core0.
 */

#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_9    0x3fffffff
#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_9_M  (SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_9_V << SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_9_S)
#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_9_V  0x3fffffff
#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_9_S  0

/* SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_13_REG register
 * Core0 region permission register 13.
 */

#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_13_REG (DR_REG_SENSITIVE_BASE + 0x194)

/* SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_10 : R/W; bitpos: [29:0];
 * default: 0;
 * Region 9 end address and Region 10 start address for core0.
 */

#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_10    0x3fffffff
#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_10_M  (SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_10_V << SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_10_S)
#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_10_V  0x3fffffff
#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_10_S  0

/* SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_14_REG register
 * Core0 region permission register 14.
 */

#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_14_REG (DR_REG_SENSITIVE_BASE + 0x198)

/* SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_11 : R/W; bitpos: [29:0];
 * default: 0;
 * Region 10 end address for core0.
 */

#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_11    0x3fffffff
#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_11_M  (SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_11_V << SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_11_S)
#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_11_V  0x3fffffff
#define SENSITIVE_CORE_0_REGION_PMS_CONSTRAIN_ADDR_11_S  0

/* SENSITIVE_CORE_0_PIF_PMS_MONITOR_0_REG register
 * Core0 permission report register 0.
 */

#define SENSITIVE_CORE_0_PIF_PMS_MONITOR_0_REG (DR_REG_SENSITIVE_BASE + 0x19c)

/* SENSITIVE_CORE_0_PIF_PMS_MONITOR_LOCK : R/W; bitpos: [0]; default: 0;
 * Set 1 to lock core0 permission report registers.
 */

#define SENSITIVE_CORE_0_PIF_PMS_MONITOR_LOCK    (BIT(0))
#define SENSITIVE_CORE_0_PIF_PMS_MONITOR_LOCK_M  (SENSITIVE_CORE_0_PIF_PMS_MONITOR_LOCK_V << SENSITIVE_CORE_0_PIF_PMS_MONITOR_LOCK_S)
#define SENSITIVE_CORE_0_PIF_PMS_MONITOR_LOCK_V  0x00000001
#define SENSITIVE_CORE_0_PIF_PMS_MONITOR_LOCK_S  0

/* SENSITIVE_CORE_0_PIF_PMS_MONITOR_1_REG register
 * Core0 permission report register 1.
 */

#define SENSITIVE_CORE_0_PIF_PMS_MONITOR_1_REG (DR_REG_SENSITIVE_BASE + 0x1a0)

/* SENSITIVE_CORE_0_PIF_PMS_MONITOR_VIOLATE_EN : R/W; bitpos: [1]; default:
 * 1;
 * Set 1 to enable interrupt that core0 initiate illegal PIF bus access.
 */

#define SENSITIVE_CORE_0_PIF_PMS_MONITOR_VIOLATE_EN    (BIT(1))
#define SENSITIVE_CORE_0_PIF_PMS_MONITOR_VIOLATE_EN_M  (SENSITIVE_CORE_0_PIF_PMS_MONITOR_VIOLATE_EN_V << SENSITIVE_CORE_0_PIF_PMS_MONITOR_VIOLATE_EN_S)
#define SENSITIVE_CORE_0_PIF_PMS_MONITOR_VIOLATE_EN_V  0x00000001
#define SENSITIVE_CORE_0_PIF_PMS_MONITOR_VIOLATE_EN_S  1

/* SENSITIVE_CORE_0_PIF_PMS_MONITOR_VIOLATE_CLR : R/W; bitpos: [0]; default:
 * 1;
 * Set 1 to clear interrupt that core0 initiate illegal PIF bus access.
 */

#define SENSITIVE_CORE_0_PIF_PMS_MONITOR_VIOLATE_CLR    (BIT(0))
#define SENSITIVE_CORE_0_PIF_PMS_MONITOR_VIOLATE_CLR_M  (SENSITIVE_CORE_0_PIF_PMS_MONITOR_VIOLATE_CLR_V << SENSITIVE_CORE_0_PIF_PMS_MONITOR_VIOLATE_CLR_S)
#define SENSITIVE_CORE_0_PIF_PMS_MONITOR_VIOLATE_CLR_V  0x00000001
#define SENSITIVE_CORE_0_PIF_PMS_MONITOR_VIOLATE_CLR_S  0

/* SENSITIVE_CORE_0_PIF_PMS_MONITOR_2_REG register
 * Core0 permission report register 2.
 */

#define SENSITIVE_CORE_0_PIF_PMS_MONITOR_2_REG (DR_REG_SENSITIVE_BASE + 0x1a4)

/* SENSITIVE_CORE_0_PIF_PMS_MONITOR_VIOLATE_STATUS_HWORLD : RO; bitpos:
 * [7:6]; default: 0;
 * Record world information when core0 initiate illegal access.
 */

#define SENSITIVE_CORE_0_PIF_PMS_MONITOR_VIOLATE_STATUS_HWORLD    0x00000003
#define SENSITIVE_CORE_0_PIF_PMS_MONITOR_VIOLATE_STATUS_HWORLD_M  (SENSITIVE_CORE_0_PIF_PMS_MONITOR_VIOLATE_STATUS_HWORLD_V << SENSITIVE_CORE_0_PIF_PMS_MONITOR_VIOLATE_STATUS_HWORLD_S)
#define SENSITIVE_CORE_0_PIF_PMS_MONITOR_VIOLATE_STATUS_HWORLD_V  0x00000003
#define SENSITIVE_CORE_0_PIF_PMS_MONITOR_VIOLATE_STATUS_HWORLD_S  6

/* SENSITIVE_CORE_0_PIF_PMS_MONITOR_VIOLATE_STATUS_HWRITE : RO; bitpos: [5];
 * default: 0;
 * Record access direction when core0 initiate illegal access.
 */

#define SENSITIVE_CORE_0_PIF_PMS_MONITOR_VIOLATE_STATUS_HWRITE    (BIT(5))
#define SENSITIVE_CORE_0_PIF_PMS_MONITOR_VIOLATE_STATUS_HWRITE_M  (SENSITIVE_CORE_0_PIF_PMS_MONITOR_VIOLATE_STATUS_HWRITE_V << SENSITIVE_CORE_0_PIF_PMS_MONITOR_VIOLATE_STATUS_HWRITE_S)
#define SENSITIVE_CORE_0_PIF_PMS_MONITOR_VIOLATE_STATUS_HWRITE_V  0x00000001
#define SENSITIVE_CORE_0_PIF_PMS_MONITOR_VIOLATE_STATUS_HWRITE_S  5

/* SENSITIVE_CORE_0_PIF_PMS_MONITOR_VIOLATE_STATUS_HSIZE : RO; bitpos:
 * [4:2]; default: 0;
 * Record access type when core0 initiates an illegal access.
 */

#define SENSITIVE_CORE_0_PIF_PMS_MONITOR_VIOLATE_STATUS_HSIZE    0x00000007
#define SENSITIVE_CORE_0_PIF_PMS_MONITOR_VIOLATE_STATUS_HSIZE_M  (SENSITIVE_CORE_0_PIF_PMS_MONITOR_VIOLATE_STATUS_HSIZE_V << SENSITIVE_CORE_0_PIF_PMS_MONITOR_VIOLATE_STATUS_HSIZE_S)
#define SENSITIVE_CORE_0_PIF_PMS_MONITOR_VIOLATE_STATUS_HSIZE_V  0x00000007
#define SENSITIVE_CORE_0_PIF_PMS_MONITOR_VIOLATE_STATUS_HSIZE_S  2

/* SENSITIVE_CORE_0_PIF_PMS_MONITOR_VIOLATE_STATUS_HPORT_0 : RO; bitpos:
 * [1]; default: 0;
 * Record hport information when core0 initiate illegal access.
 */

