apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_sensitive.h
#define SENSITIVE_CORE_0_VECBASE_OVERRIDE_0_REG (DR_REG_SENSITIVE_BASE + 0x1bc)

/* SENSITIVE_CORE_0_VECBASE_WORLD_MASK : R/W; bitpos: [0]; default: 1;
 * Set 1 to mask world, then only world0_value will work.
 */

#define SENSITIVE_CORE_0_VECBASE_WORLD_MASK    (BIT(0))
#define SENSITIVE_CORE_0_VECBASE_WORLD_MASK_M  (SENSITIVE_CORE_0_VECBASE_WORLD_MASK_V << SENSITIVE_CORE_0_VECBASE_WORLD_MASK_S)
#define SENSITIVE_CORE_0_VECBASE_WORLD_MASK_V  0x00000001
#define SENSITIVE_CORE_0_VECBASE_WORLD_MASK_S  0

/* SENSITIVE_CORE_0_VECBASE_OVERRIDE_1_REG register
 * core0 vecbase override configuration register 1
 */

#define SENSITIVE_CORE_0_VECBASE_OVERRIDE_1_REG (DR_REG_SENSITIVE_BASE + 0x1c0)

/* SENSITIVE_CORE_0_VECBASE_OVERRIDE_SEL : R/W; bitpos: [23:22]; default: 0;
 * Set 0x3 to sel vecbase_override to override vecbase register.
 */

#define SENSITIVE_CORE_0_VECBASE_OVERRIDE_SEL    0x00000003
#define SENSITIVE_CORE_0_VECBASE_OVERRIDE_SEL_M  (SENSITIVE_CORE_0_VECBASE_OVERRIDE_SEL_V << SENSITIVE_CORE_0_VECBASE_OVERRIDE_SEL_S)
#define SENSITIVE_CORE_0_VECBASE_OVERRIDE_SEL_V  0x00000003
#define SENSITIVE_CORE_0_VECBASE_OVERRIDE_SEL_S  22

/* SENSITIVE_CORE_0_VECBASE_OVERRIDE_WORLD0_VALUE : R/W; bitpos: [21:0];
 * default: 0;
 * world0 vecbase_override register, when core0 in world0 use this register
 * to override vecbase register.
 */

#define SENSITIVE_CORE_0_VECBASE_OVERRIDE_WORLD0_VALUE    0x003fffff
#define SENSITIVE_CORE_0_VECBASE_OVERRIDE_WORLD0_VALUE_M  (SENSITIVE_CORE_0_VECBASE_OVERRIDE_WORLD0_VALUE_V << SENSITIVE_CORE_0_VECBASE_OVERRIDE_WORLD0_VALUE_S)
#define SENSITIVE_CORE_0_VECBASE_OVERRIDE_WORLD0_VALUE_V  0x003fffff
#define SENSITIVE_CORE_0_VECBASE_OVERRIDE_WORLD0_VALUE_S  0

/* SENSITIVE_CORE_0_VECBASE_OVERRIDE_2_REG register
 * core0 vecbase override configuration register 1
 */

#define SENSITIVE_CORE_0_VECBASE_OVERRIDE_2_REG (DR_REG_SENSITIVE_BASE + 0x1c4)

/* SENSITIVE_CORE_0_VECBASE_OVERRIDE_WORLD1_VALUE : R/W; bitpos: [21:0];
 * default: 0;
 * world1 vecbase_override register, when core0 in world1 use this register
 * to override vecbase register.
 */

#define SENSITIVE_CORE_0_VECBASE_OVERRIDE_WORLD1_VALUE    0x003fffff
#define SENSITIVE_CORE_0_VECBASE_OVERRIDE_WORLD1_VALUE_M  (SENSITIVE_CORE_0_VECBASE_OVERRIDE_WORLD1_VALUE_V << SENSITIVE_CORE_0_VECBASE_OVERRIDE_WORLD1_VALUE_S)
#define SENSITIVE_CORE_0_VECBASE_OVERRIDE_WORLD1_VALUE_V  0x003fffff
#define SENSITIVE_CORE_0_VECBASE_OVERRIDE_WORLD1_VALUE_S  0

/* SENSITIVE_CORE_0_TOOMANYEXCEPTIONS_M_OVERRIDE_0_REG register
 * core0 toomanyexception override configuration register 0.
 */

#define SENSITIVE_CORE_0_TOOMANYEXCEPTIONS_M_OVERRIDE_0_REG (DR_REG_SENSITIVE_BASE + 0x1c8)

/* SENSITIVE_CORE_0_TOOMANYEXCEPTIONS_M_OVERRIDE_LOCK : R/W; bitpos: [0];
 * default: 0;
 * Set 1 to lock core0 toomanyexception override configuration register
 */

#define SENSITIVE_CORE_0_TOOMANYEXCEPTIONS_M_OVERRIDE_LOCK    (BIT(0))
#define SENSITIVE_CORE_0_TOOMANYEXCEPTIONS_M_OVERRIDE_LOCK_M  (SENSITIVE_CORE_0_TOOMANYEXCEPTIONS_M_OVERRIDE_LOCK_V << SENSITIVE_CORE_0_TOOMANYEXCEPTIONS_M_OVERRIDE_LOCK_S)
#define SENSITIVE_CORE_0_TOOMANYEXCEPTIONS_M_OVERRIDE_LOCK_V  0x00000001
#define SENSITIVE_CORE_0_TOOMANYEXCEPTIONS_M_OVERRIDE_LOCK_S  0

/* SENSITIVE_CORE_0_TOOMANYEXCEPTIONS_M_OVERRIDE_1_REG register
 * core0 toomanyexception override configuration register 1.
 */

#define SENSITIVE_CORE_0_TOOMANYEXCEPTIONS_M_OVERRIDE_1_REG (DR_REG_SENSITIVE_BASE + 0x1cc)

/* SENSITIVE_CORE_0_TOOMANYEXCEPTIONS_M_OVERRIDE : R/W; bitpos: [0];
 * default: 1;
 * Set 1 to mask toomanyexception.
 */

#define SENSITIVE_CORE_0_TOOMANYEXCEPTIONS_M_OVERRIDE    (BIT(0))
#define SENSITIVE_CORE_0_TOOMANYEXCEPTIONS_M_OVERRIDE_M  (SENSITIVE_CORE_0_TOOMANYEXCEPTIONS_M_OVERRIDE_V << SENSITIVE_CORE_0_TOOMANYEXCEPTIONS_M_OVERRIDE_S)
#define SENSITIVE_CORE_0_TOOMANYEXCEPTIONS_M_OVERRIDE_V  0x00000001
#define SENSITIVE_CORE_0_TOOMANYEXCEPTIONS_M_OVERRIDE_S  0

/* SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_0_REG register
 * Core1 access peripherals permission configuration register 0.
 */

#define SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_0_REG (DR_REG_SENSITIVE_BASE + 0x1d0)

/* SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_LOCK : R/W; bitpos: [0]; default: 0;
 * Set 1 to lock core1 pif permission configuration register.
 */

#define SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_LOCK    (BIT(0))
#define SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_LOCK_M  (SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_LOCK_V << SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_LOCK_S)
#define SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_LOCK_V  0x00000001
#define SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_LOCK_S  0

/* SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_1_REG register
 * Core1 access peripherals permission configuration register 1.
 */

#define SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_1_REG (DR_REG_SENSITIVE_BASE + 0x1d4)

/* SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_UART1 : R/W; bitpos: [31:30];
 * default: 3;
 * Core1 access uart1 permission in world0.
 */

#define SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_UART1    0x00000003
#define SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_UART1_M  (SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_UART1_V << SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_UART1_S)
#define SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_UART1_V  0x00000003
#define SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_UART1_S  30

/* SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_I2S0 : R/W; bitpos: [29:28];
 * default: 3;
 * Core1 access i2s0 permission in world0.
 */

#define SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_I2S0    0x00000003
#define SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_I2S0_M  (SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_I2S0_V << SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_I2S0_S)
#define SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_I2S0_V  0x00000003
#define SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_I2S0_S  28

/* SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_I2C : R/W; bitpos: [27:26];
 * default: 3;
 * Core1 access i2c permission in world0.
 */

#define SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_I2C    0x00000003
#define SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_I2C_M  (SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_I2C_V << SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_I2C_S)
#define SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_I2C_V  0x00000003
#define SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_I2C_S  26

/* SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_MISC : R/W; bitpos: [25:24];
 * default: 3;
 * Core1 access misc permission in world0.
 */

#define SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_MISC    0x00000003
#define SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_MISC_M  (SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_MISC_V << SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_MISC_S)
#define SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_MISC_V  0x00000003
#define SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_MISC_S  24

/* SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_HINF : R/W; bitpos: [21:20];
 * default: 3;
 * Core1 access hinf permission in world0.
 */

#define SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_HINF    0x00000003
#define SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_HINF_M  (SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_HINF_V << SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_HINF_S)
#define SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_HINF_V  0x00000003
#define SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_HINF_S  20

/* SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_IO_MUX : R/W; bitpos: [17:16];
 * default: 3;
 * Core1 access io_mux permission in world0.
 */

#define SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_IO_MUX    0x00000003
#define SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_IO_MUX_M  (SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_IO_MUX_V << SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_IO_MUX_S)
#define SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_IO_MUX_V  0x00000003
#define SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_IO_MUX_S  16

/* SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_RTC : R/W; bitpos: [15:14];
 * default: 3;
 * Core1 access rtc permission in world0.
 */

#define SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_RTC    0x00000003
#define SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_RTC_M  (SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_RTC_V << SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_RTC_S)
#define SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_RTC_V  0x00000003
#define SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_RTC_S  14

/* SENSITIVE_CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_FE : R/W; bitpos: [11:10];
 * default: 3;
 * Core1 access fe permission in world0.
 */

