apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_sensitive.h
#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_WORLD_1_AREA_0    0x00000003
#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_WORLD_1_AREA_0_M  (SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_WORLD_1_AREA_0_V << SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_WORLD_1_AREA_0_S)
#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_WORLD_1_AREA_0_V  0x00000003
#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_WORLD_1_AREA_0_S  0

/* SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_3_REG register
 * core1 region permission register 3.
 */

#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_3_REG (DR_REG_SENSITIVE_BASE + 0x218)

/* SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_0 : R/W; bitpos: [29:0];
 * default: 0;
 * Region 0 start address for core1.
 */

#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_0    0x3fffffff
#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_0_M  (SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_0_V << SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_0_S)
#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_0_V  0x3fffffff
#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_0_S  0

/* SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_4_REG register
 * core1 region permission register 4.
 */

#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_4_REG (DR_REG_SENSITIVE_BASE + 0x21c)

/* SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_1 : R/W; bitpos: [29:0];
 * default: 0;
 * Region 0 end address and Region 1 start address for core1.
 */

#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_1    0x3fffffff
#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_1_M  (SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_1_V << SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_1_S)
#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_1_V  0x3fffffff
#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_1_S  0

/* SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_5_REG register
 * core1 region permission register 5.
 */

#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_5_REG (DR_REG_SENSITIVE_BASE + 0x220)

/* SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_2 : R/W; bitpos: [29:0];
 * default: 0;
 * Region 1 end address and Region 2 start address for core1.
 */

#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_2    0x3fffffff
#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_2_M  (SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_2_V << SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_2_S)
#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_2_V  0x3fffffff
#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_2_S  0

/* SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_6_REG register
 * core1 region permission register 6.
 */

#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_6_REG (DR_REG_SENSITIVE_BASE + 0x224)

/* SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_3 : R/W; bitpos: [29:0];
 * default: 0;
 * Region 2 end address and Region 3 start address for core1.
 */

#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_3    0x3fffffff
#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_3_M  (SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_3_V << SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_3_S)
#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_3_V  0x3fffffff
#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_3_S  0

/* SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_7_REG register
 * core1 region permission register 7.
 */

#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_7_REG (DR_REG_SENSITIVE_BASE + 0x228)

/* SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_4 : R/W; bitpos: [29:0];
 * default: 0;
 * Region 3 end address and Region 4 start address for core1.
 */

#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_4    0x3fffffff
#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_4_M  (SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_4_V << SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_4_S)
#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_4_V  0x3fffffff
#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_4_S  0

/* SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_8_REG register
 * core1 region permission register 8.
 */

#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_8_REG (DR_REG_SENSITIVE_BASE + 0x22c)

/* SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_5 : R/W; bitpos: [29:0];
 * default: 0;
 * Region 4 end address and Region 5 start address for core1.
 */

#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_5    0x3fffffff
#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_5_M  (SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_5_V << SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_5_S)
#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_5_V  0x3fffffff
#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_5_S  0

/* SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_9_REG register
 * core1 region permission register 9.
 */

#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_9_REG (DR_REG_SENSITIVE_BASE + 0x230)

/* SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_6 : R/W; bitpos: [29:0];
 * default: 0;
 * Region 5 end address and Region 6 start address for core1.
 */

#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_6    0x3fffffff
#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_6_M  (SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_6_V << SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_6_S)
#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_6_V  0x3fffffff
#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_6_S  0

/* SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_10_REG register
 * core1 region permission register 10.
 */

#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_10_REG (DR_REG_SENSITIVE_BASE + 0x234)

/* SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_7 : R/W; bitpos: [29:0];
 * default: 0;
 * Region 6 end address and Region 7 start address for core1.
 */

#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_7    0x3fffffff
#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_7_M  (SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_7_V << SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_7_S)
#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_7_V  0x3fffffff
#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_7_S  0

/* SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_11_REG register
 * core1 region permission register 11.
 */

#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_11_REG (DR_REG_SENSITIVE_BASE + 0x238)

/* SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_8 : R/W; bitpos: [29:0];
 * default: 0;
 * Region 7 end address and Region 8 start address for core1.
 */

#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_8    0x3fffffff
#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_8_M  (SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_8_V << SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_8_S)
#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_8_V  0x3fffffff
#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_8_S  0

/* SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_12_REG register
 * core1 region permission register 12.
 */

#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_12_REG (DR_REG_SENSITIVE_BASE + 0x23c)

/* SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_9 : R/W; bitpos: [29:0];
 * default: 0;
 * Region 8 end address and Region 9 start address for core1.
 */

#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_9    0x3fffffff
#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_9_M  (SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_9_V << SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_9_S)
#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_9_V  0x3fffffff
#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_9_S  0

/* SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_13_REG register
 * core1 region permission register 13.
 */

#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_13_REG (DR_REG_SENSITIVE_BASE + 0x240)

/* SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_10 : R/W; bitpos: [29:0];
 * default: 0;
 * Region 9 end address and Region 10 start address for core1.
 */

#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_10    0x3fffffff
#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_10_M  (SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_10_V << SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_10_S)
#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_10_V  0x3fffffff
#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_10_S  0

/* SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_14_REG register
 * core1 region permission register 14.
 */

