apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_sensitive.h
#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_14_REG (DR_REG_SENSITIVE_BASE + 0x244)

/* SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_11 : R/W; bitpos: [29:0];
 * default: 0;
 * Region 10 end address for core1.
 */

#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_11    0x3fffffff
#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_11_M  (SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_11_V << SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_11_S)
#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_11_V  0x3fffffff
#define SENSITIVE_CORE_1_REGION_PMS_CONSTRAIN_ADDR_11_S  0

/* SENSITIVE_CORE_1_PIF_PMS_MONITOR_0_REG register
 * core1 permission report register 0.
 */

#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_0_REG (DR_REG_SENSITIVE_BASE + 0x248)

/* SENSITIVE_CORE_1_PIF_PMS_MONITOR_LOCK : R/W; bitpos: [0]; default: 0;
 * Set 1 to lock core1 permission report registers.
 */

#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_LOCK    (BIT(0))
#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_LOCK_M  (SENSITIVE_CORE_1_PIF_PMS_MONITOR_LOCK_V << SENSITIVE_CORE_1_PIF_PMS_MONITOR_LOCK_S)
#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_LOCK_V  0x00000001
#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_LOCK_S  0

/* SENSITIVE_CORE_1_PIF_PMS_MONITOR_1_REG register
 * core1 permission report register 1.
 */

#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_1_REG (DR_REG_SENSITIVE_BASE + 0x24c)

/* SENSITIVE_CORE_1_PIF_PMS_MONITOR_VIOLATE_EN : R/W; bitpos: [1]; default:
 * 1;
 * Set 1 to enable interrupt that core1 initiate illegal PIF bus access.
 */

#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_VIOLATE_EN    (BIT(1))
#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_VIOLATE_EN_M  (SENSITIVE_CORE_1_PIF_PMS_MONITOR_VIOLATE_EN_V << SENSITIVE_CORE_1_PIF_PMS_MONITOR_VIOLATE_EN_S)
#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_VIOLATE_EN_V  0x00000001
#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_VIOLATE_EN_S  1

/* SENSITIVE_CORE_1_PIF_PMS_MONITOR_VIOLATE_CLR : R/W; bitpos: [0]; default:
 * 1;
 * Set 1 to clear interrupt that core1 initiate illegal PIF bus access.
 */

#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_VIOLATE_CLR    (BIT(0))
#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_VIOLATE_CLR_M  (SENSITIVE_CORE_1_PIF_PMS_MONITOR_VIOLATE_CLR_V << SENSITIVE_CORE_1_PIF_PMS_MONITOR_VIOLATE_CLR_S)
#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_VIOLATE_CLR_V  0x00000001
#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_VIOLATE_CLR_S  0

/* SENSITIVE_CORE_1_PIF_PMS_MONITOR_2_REG register
 * core1 permission report register 2.
 */

#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_2_REG (DR_REG_SENSITIVE_BASE + 0x250)

/* SENSITIVE_CORE_1_PIF_PMS_MONITOR_VIOLATE_STATUS_HWORLD : RO; bitpos:
 * [7:6]; default: 0;
 * Record world information when core1 initiate illegal access.
 */

#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_VIOLATE_STATUS_HWORLD    0x00000003
#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_VIOLATE_STATUS_HWORLD_M  (SENSITIVE_CORE_1_PIF_PMS_MONITOR_VIOLATE_STATUS_HWORLD_V << SENSITIVE_CORE_1_PIF_PMS_MONITOR_VIOLATE_STATUS_HWORLD_S)
#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_VIOLATE_STATUS_HWORLD_V  0x00000003
#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_VIOLATE_STATUS_HWORLD_S  6

/* SENSITIVE_CORE_1_PIF_PMS_MONITOR_VIOLATE_STATUS_HWRITE : RO; bitpos: [5];
 * default: 0;
 * Record access direction when core1 initiate illegal access.
 */

#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_VIOLATE_STATUS_HWRITE    (BIT(5))
#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_VIOLATE_STATUS_HWRITE_M  (SENSITIVE_CORE_1_PIF_PMS_MONITOR_VIOLATE_STATUS_HWRITE_V << SENSITIVE_CORE_1_PIF_PMS_MONITOR_VIOLATE_STATUS_HWRITE_S)
#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_VIOLATE_STATUS_HWRITE_V  0x00000001
#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_VIOLATE_STATUS_HWRITE_S  5

/* SENSITIVE_CORE_1_PIF_PMS_MONITOR_VIOLATE_STATUS_HSIZE : RO; bitpos:
 * [4:2]; default: 0;
 * Record access type when core1 initiates an illegal access.
 */

#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_VIOLATE_STATUS_HSIZE    0x00000007
#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_VIOLATE_STATUS_HSIZE_M  (SENSITIVE_CORE_1_PIF_PMS_MONITOR_VIOLATE_STATUS_HSIZE_V << SENSITIVE_CORE_1_PIF_PMS_MONITOR_VIOLATE_STATUS_HSIZE_S)
#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_VIOLATE_STATUS_HSIZE_V  0x00000007
#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_VIOLATE_STATUS_HSIZE_S  2

/* SENSITIVE_CORE_1_PIF_PMS_MONITOR_VIOLATE_STATUS_HPORT_0 : RO; bitpos:
 * [1]; default: 0;
 * Record hport information when core1 initiate illegal access.
 */

#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_VIOLATE_STATUS_HPORT_0    (BIT(1))
#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_VIOLATE_STATUS_HPORT_0_M  (SENSITIVE_CORE_1_PIF_PMS_MONITOR_VIOLATE_STATUS_HPORT_0_V << SENSITIVE_CORE_1_PIF_PMS_MONITOR_VIOLATE_STATUS_HPORT_0_S)
#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_VIOLATE_STATUS_HPORT_0_V  0x00000001
#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_VIOLATE_STATUS_HPORT_0_S  1

/* SENSITIVE_CORE_1_PIF_PMS_MONITOR_VIOLATE_INTR : RO; bitpos: [0]; default:
 * 0;
 * Record core1 illegal access interrupt state.
 */

#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_VIOLATE_INTR    (BIT(0))
#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_VIOLATE_INTR_M  (SENSITIVE_CORE_1_PIF_PMS_MONITOR_VIOLATE_INTR_V << SENSITIVE_CORE_1_PIF_PMS_MONITOR_VIOLATE_INTR_S)
#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_VIOLATE_INTR_V  0x00000001
#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_VIOLATE_INTR_S  0

/* SENSITIVE_CORE_1_PIF_PMS_MONITOR_3_REG register
 * core1 permission report register 3.
 */

#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_3_REG (DR_REG_SENSITIVE_BASE + 0x254)

/* SENSITIVE_CORE_1_PIF_PMS_MONITOR_VIOLATE_STATUS_HADDR : RO; bitpos:
 * [31:0]; default: 0;
 * Record address information when core1 initiate illegal access.
 */

#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_VIOLATE_STATUS_HADDR    0xffffffff
#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_VIOLATE_STATUS_HADDR_M  (SENSITIVE_CORE_1_PIF_PMS_MONITOR_VIOLATE_STATUS_HADDR_V << SENSITIVE_CORE_1_PIF_PMS_MONITOR_VIOLATE_STATUS_HADDR_S)
#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_VIOLATE_STATUS_HADDR_V  0xffffffff
#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_VIOLATE_STATUS_HADDR_S  0

/* SENSITIVE_CORE_1_PIF_PMS_MONITOR_4_REG register
 * core1 permission report register 4.
 */

#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_4_REG (DR_REG_SENSITIVE_BASE + 0x258)

/* SENSITIVE_CORE_1_PIF_PMS_MONITOR_NONWORD_VIOLATE_EN : R/W; bitpos: [1];
 * default: 1;
 * Set 1 to enable interrupt that core1 initiate unsupported access type.
 */

#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_NONWORD_VIOLATE_EN    (BIT(1))
#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_NONWORD_VIOLATE_EN_M  (SENSITIVE_CORE_1_PIF_PMS_MONITOR_NONWORD_VIOLATE_EN_V << SENSITIVE_CORE_1_PIF_PMS_MONITOR_NONWORD_VIOLATE_EN_S)
#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_NONWORD_VIOLATE_EN_V  0x00000001
#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_NONWORD_VIOLATE_EN_S  1

/* SENSITIVE_CORE_1_PIF_PMS_MONITOR_NONWORD_VIOLATE_CLR : R/W; bitpos: [0];
 * default: 1;
 * Set 1 to clear interrupt that core1 initiate unsupported access type.
 */

#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_NONWORD_VIOLATE_CLR    (BIT(0))
#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_NONWORD_VIOLATE_CLR_M  (SENSITIVE_CORE_1_PIF_PMS_MONITOR_NONWORD_VIOLATE_CLR_V << SENSITIVE_CORE_1_PIF_PMS_MONITOR_NONWORD_VIOLATE_CLR_S)
#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_NONWORD_VIOLATE_CLR_V  0x00000001
#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_NONWORD_VIOLATE_CLR_S  0

