apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_sensitive.h
/* SENSITIVE_CORE_1_PIF_PMS_MONITOR_5_REG register
 * core1 permission report register 5.
 */

#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_5_REG (DR_REG_SENSITIVE_BASE + 0x25c)

/* SENSITIVE_CORE_1_PIF_PMS_MONITOR_NONWORD_VIOLATE_STATUS_HWORLD : RO;
 * bitpos: [4:3]; default: 0;
 * Record world information when core1 initiate unsupported access type.
 */

#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_NONWORD_VIOLATE_STATUS_HWORLD    0x00000003
#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_NONWORD_VIOLATE_STATUS_HWORLD_M  (SENSITIVE_CORE_1_PIF_PMS_MONITOR_NONWORD_VIOLATE_STATUS_HWORLD_V << SENSITIVE_CORE_1_PIF_PMS_MONITOR_NONWORD_VIOLATE_STATUS_HWORLD_S)
#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_NONWORD_VIOLATE_STATUS_HWORLD_V  0x00000003
#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_NONWORD_VIOLATE_STATUS_HWORLD_S  3

/* SENSITIVE_CORE_1_PIF_PMS_MONITOR_NONWORD_VIOLATE_STATUS_HSIZE : RO;
 * bitpos: [2:1]; default: 0;
 * Record access type when core1 initiate unsupported access type.
 */

#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_NONWORD_VIOLATE_STATUS_HSIZE    0x00000003
#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_NONWORD_VIOLATE_STATUS_HSIZE_M  (SENSITIVE_CORE_1_PIF_PMS_MONITOR_NONWORD_VIOLATE_STATUS_HSIZE_V << SENSITIVE_CORE_1_PIF_PMS_MONITOR_NONWORD_VIOLATE_STATUS_HSIZE_S)
#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_NONWORD_VIOLATE_STATUS_HSIZE_V  0x00000003
#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_NONWORD_VIOLATE_STATUS_HSIZE_S  1

/* SENSITIVE_CORE_1_PIF_PMS_MONITOR_NONWORD_VIOLATE_INTR : RO; bitpos: [0];
 * default: 0;
 * Record core1 unsupported access type interrupt state.
 */

#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_NONWORD_VIOLATE_INTR    (BIT(0))
#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_NONWORD_VIOLATE_INTR_M  (SENSITIVE_CORE_1_PIF_PMS_MONITOR_NONWORD_VIOLATE_INTR_V << SENSITIVE_CORE_1_PIF_PMS_MONITOR_NONWORD_VIOLATE_INTR_S)
#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_NONWORD_VIOLATE_INTR_V  0x00000001
#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_NONWORD_VIOLATE_INTR_S  0

/* SENSITIVE_CORE_1_PIF_PMS_MONITOR_6_REG register
 * core1 permission report register 6.
 */

#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_6_REG (DR_REG_SENSITIVE_BASE + 0x260)

/* SENSITIVE_CORE_1_PIF_PMS_MONITOR_NONWORD_VIOLATE_STATUS_HADDR : RO;
 * bitpos: [31:0]; default: 0;
 * Record address information when core1 initiate unsupported access type.
 */

#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_NONWORD_VIOLATE_STATUS_HADDR    0xffffffff
#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_NONWORD_VIOLATE_STATUS_HADDR_M  (SENSITIVE_CORE_1_PIF_PMS_MONITOR_NONWORD_VIOLATE_STATUS_HADDR_V << SENSITIVE_CORE_1_PIF_PMS_MONITOR_NONWORD_VIOLATE_STATUS_HADDR_S)
#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_NONWORD_VIOLATE_STATUS_HADDR_V  0xffffffff
#define SENSITIVE_CORE_1_PIF_PMS_MONITOR_NONWORD_VIOLATE_STATUS_HADDR_S  0

/* SENSITIVE_CORE_1_VECBASE_OVERRIDE_LOCK_REG register
 * core1 vecbase override configuration register 0
 */

#define SENSITIVE_CORE_1_VECBASE_OVERRIDE_LOCK_REG (DR_REG_SENSITIVE_BASE + 0x264)

/* SENSITIVE_CORE_1_VECBASE_OVERRIDE_LOCK : R/W; bitpos: [0]; default: 0;
 * Set 1 to lock core1 vecbase configuration register
 */

#define SENSITIVE_CORE_1_VECBASE_OVERRIDE_LOCK    (BIT(0))
#define SENSITIVE_CORE_1_VECBASE_OVERRIDE_LOCK_M  (SENSITIVE_CORE_1_VECBASE_OVERRIDE_LOCK_V << SENSITIVE_CORE_1_VECBASE_OVERRIDE_LOCK_S)
#define SENSITIVE_CORE_1_VECBASE_OVERRIDE_LOCK_V  0x00000001
#define SENSITIVE_CORE_1_VECBASE_OVERRIDE_LOCK_S  0

/* SENSITIVE_CORE_1_VECBASE_OVERRIDE_0_REG register
 * core1 vecbase override configuration register 0
 */

#define SENSITIVE_CORE_1_VECBASE_OVERRIDE_0_REG (DR_REG_SENSITIVE_BASE + 0x268)

/* SENSITIVE_CORE_1_VECBASE_WORLD_MASK : R/W; bitpos: [0]; default: 1;
 * Set 1 to mask world, then only world0_value will work.
 */

#define SENSITIVE_CORE_1_VECBASE_WORLD_MASK    (BIT(0))
#define SENSITIVE_CORE_1_VECBASE_WORLD_MASK_M  (SENSITIVE_CORE_1_VECBASE_WORLD_MASK_V << SENSITIVE_CORE_1_VECBASE_WORLD_MASK_S)
#define SENSITIVE_CORE_1_VECBASE_WORLD_MASK_V  0x00000001
#define SENSITIVE_CORE_1_VECBASE_WORLD_MASK_S  0

/* SENSITIVE_CORE_1_VECBASE_OVERRIDE_1_REG register
 * core1 vecbase override configuration register 1
 */

#define SENSITIVE_CORE_1_VECBASE_OVERRIDE_1_REG (DR_REG_SENSITIVE_BASE + 0x26c)

/* SENSITIVE_CORE_1_VECBASE_OVERRIDE_SEL : R/W; bitpos: [23:22]; default: 0;
 * Set 0x3 to sel vecbase_override to override vecbase register.
 */

#define SENSITIVE_CORE_1_VECBASE_OVERRIDE_SEL    0x00000003
#define SENSITIVE_CORE_1_VECBASE_OVERRIDE_SEL_M  (SENSITIVE_CORE_1_VECBASE_OVERRIDE_SEL_V << SENSITIVE_CORE_1_VECBASE_OVERRIDE_SEL_S)
#define SENSITIVE_CORE_1_VECBASE_OVERRIDE_SEL_V  0x00000003
#define SENSITIVE_CORE_1_VECBASE_OVERRIDE_SEL_S  22

/* SENSITIVE_CORE_1_VECBASE_OVERRIDE_WORLD0_VALUE : R/W; bitpos: [21:0];
 * default: 0;
 * world0 vecbase_override register, when core1 in world0 use this register
 * to override vecbase register.
 */

#define SENSITIVE_CORE_1_VECBASE_OVERRIDE_WORLD0_VALUE    0x003fffff
#define SENSITIVE_CORE_1_VECBASE_OVERRIDE_WORLD0_VALUE_M  (SENSITIVE_CORE_1_VECBASE_OVERRIDE_WORLD0_VALUE_V << SENSITIVE_CORE_1_VECBASE_OVERRIDE_WORLD0_VALUE_S)
#define SENSITIVE_CORE_1_VECBASE_OVERRIDE_WORLD0_VALUE_V  0x003fffff
#define SENSITIVE_CORE_1_VECBASE_OVERRIDE_WORLD0_VALUE_S  0

/* SENSITIVE_CORE_1_VECBASE_OVERRIDE_2_REG register
 * core1 vecbase override configuration register 1
 */

#define SENSITIVE_CORE_1_VECBASE_OVERRIDE_2_REG (DR_REG_SENSITIVE_BASE + 0x270)

/* SENSITIVE_CORE_1_VECBASE_OVERRIDE_WORLD1_VALUE : R/W; bitpos: [21:0];
 * default: 0;
 * world1 vecbase_override register, when core1 in world1 use this register
 * to override vecbase register.
 */

#define SENSITIVE_CORE_1_VECBASE_OVERRIDE_WORLD1_VALUE    0x003fffff
#define SENSITIVE_CORE_1_VECBASE_OVERRIDE_WORLD1_VALUE_M  (SENSITIVE_CORE_1_VECBASE_OVERRIDE_WORLD1_VALUE_V << SENSITIVE_CORE_1_VECBASE_OVERRIDE_WORLD1_VALUE_S)
#define SENSITIVE_CORE_1_VECBASE_OVERRIDE_WORLD1_VALUE_V  0x003fffff
#define SENSITIVE_CORE_1_VECBASE_OVERRIDE_WORLD1_VALUE_S  0

