apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_sensitive.h
/* SENSITIVE_CORE_1_TOOMANYEXCEPTIONS_M_OVERRIDE_0_REG register
 * core1 toomanyexception override configuration register 0.
 */

#define SENSITIVE_CORE_1_TOOMANYEXCEPTIONS_M_OVERRIDE_0_REG (DR_REG_SENSITIVE_BASE + 0x274)

/* SENSITIVE_CORE_1_TOOMANYEXCEPTIONS_M_OVERRIDE_LOCK : R/W; bitpos: [0];
 * default: 0;
 * Set 1 to lock core1 toomanyexception override configuration register
 */

#define SENSITIVE_CORE_1_TOOMANYEXCEPTIONS_M_OVERRIDE_LOCK    (BIT(0))
#define SENSITIVE_CORE_1_TOOMANYEXCEPTIONS_M_OVERRIDE_LOCK_M  (SENSITIVE_CORE_1_TOOMANYEXCEPTIONS_M_OVERRIDE_LOCK_V << SENSITIVE_CORE_1_TOOMANYEXCEPTIONS_M_OVERRIDE_LOCK_S)
#define SENSITIVE_CORE_1_TOOMANYEXCEPTIONS_M_OVERRIDE_LOCK_V  0x00000001
#define SENSITIVE_CORE_1_TOOMANYEXCEPTIONS_M_OVERRIDE_LOCK_S  0

/* SENSITIVE_CORE_1_TOOMANYEXCEPTIONS_M_OVERRIDE_1_REG register
 * core1 toomanyexception override configuration register 1.
 */

#define SENSITIVE_CORE_1_TOOMANYEXCEPTIONS_M_OVERRIDE_1_REG (DR_REG_SENSITIVE_BASE + 0x278)

/* SENSITIVE_CORE_1_TOOMANYEXCEPTIONS_M_OVERRIDE : R/W; bitpos: [0];
 * default: 1;
 * Set 1 to mask toomanyexception.
 */

#define SENSITIVE_CORE_1_TOOMANYEXCEPTIONS_M_OVERRIDE    (BIT(0))
#define SENSITIVE_CORE_1_TOOMANYEXCEPTIONS_M_OVERRIDE_M  (SENSITIVE_CORE_1_TOOMANYEXCEPTIONS_M_OVERRIDE_V << SENSITIVE_CORE_1_TOOMANYEXCEPTIONS_M_OVERRIDE_S)
#define SENSITIVE_CORE_1_TOOMANYEXCEPTIONS_M_OVERRIDE_V  0x00000001
#define SENSITIVE_CORE_1_TOOMANYEXCEPTIONS_M_OVERRIDE_S  0

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_0_REG register
 * BackUp access peripherals permission configuration register 0.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_0_REG (DR_REG_SENSITIVE_BASE + 0x27c)

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_LOCK : R/W; bitpos: [0]; default: 0;
 * Set 1 to lock BackUp permission configuration registers.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_LOCK    (BIT(0))
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_LOCK_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_LOCK_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_LOCK_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_LOCK_V  0x00000001
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_LOCK_S  0

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_1_REG register
 * BackUp access peripherals permission configuration register 1.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_1_REG (DR_REG_SENSITIVE_BASE + 0x280)

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_UART1 : R/W; bitpos: [31:30]; default:
 * 3;
 * BackUp access uart1 permission.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_UART1    0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_UART1_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_UART1_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_UART1_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_UART1_V  0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_UART1_S  30

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_I2S0 : R/W; bitpos: [29:28]; default:
 * 3;
 * BackUp access i2s0 permission.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_I2S0    0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_I2S0_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_I2S0_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_I2S0_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_I2S0_V  0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_I2S0_S  28

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_I2C : R/W; bitpos: [27:26]; default: 3;
 * BackUp access i2c permission.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_I2C    0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_I2C_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_I2C_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_I2C_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_I2C_V  0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_I2C_S  26

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_MISC : R/W; bitpos: [25:24]; default:
 * 3;
 * BackUp access misc permission.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_MISC    0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_MISC_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_MISC_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_MISC_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_MISC_V  0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_MISC_S  24

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_HINF : R/W; bitpos: [21:20]; default:
 * 3;
 * BackUp access hinf permission.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_HINF    0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_HINF_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_HINF_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_HINF_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_HINF_V  0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_HINF_S  20

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_IO_MUX : R/W; bitpos: [17:16];
 * default: 3;
 * BackUp access io_mux permission.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_IO_MUX    0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_IO_MUX_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_IO_MUX_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_IO_MUX_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_IO_MUX_V  0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_IO_MUX_S  16

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_RTC : R/W; bitpos: [15:14]; default: 3;
 * BackUp access rtc permission.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_RTC    0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_RTC_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_RTC_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_RTC_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_RTC_V  0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_RTC_S  14

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_FE : R/W; bitpos: [11:10]; default: 3;
 * BackUp access fe permission.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_FE    0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_FE_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_FE_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_FE_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_FE_V  0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_FE_S  10

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_FE2 : R/W; bitpos: [9:8]; default: 3;
 * BackUp access fe2 permission.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_FE2    0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_FE2_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_FE2_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_FE2_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_FE2_V  0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_FE2_S  8

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_GPIO : R/W; bitpos: [7:6]; default: 3;
 * BackUp access gpio permission.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_GPIO    0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_GPIO_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_GPIO_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_GPIO_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_GPIO_V  0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_GPIO_S  6

