apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_sensitive.h
/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_G0SPI_0 : R/W; bitpos: [5:4]; default:
 * 3;
 * BackUp access g0spi_0 permission.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_G0SPI_0    0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_G0SPI_0_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_G0SPI_0_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_G0SPI_0_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_G0SPI_0_V  0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_G0SPI_0_S  4

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_G0SPI_1 : R/W; bitpos: [3:2]; default:
 * 3;
 * BackUp access g0spi_1 permission.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_G0SPI_1    0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_G0SPI_1_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_G0SPI_1_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_G0SPI_1_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_G0SPI_1_V  0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_G0SPI_1_S  2

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_UART : R/W; bitpos: [1:0]; default: 3;
 * BackUp access uart permission.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_UART    0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_UART_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_UART_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_UART_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_UART_V  0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_UART_S  0

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_2_REG register
 * BackUp access peripherals permission configuration register 2.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_2_REG (DR_REG_SENSITIVE_BASE + 0x284)

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_SYSTIMER : R/W; bitpos: [31:30];
 * default: 3;
 * BackUp access systimer permission.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_SYSTIMER    0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_SYSTIMER_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_SYSTIMER_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_SYSTIMER_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_SYSTIMER_V  0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_SYSTIMER_S  30

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_TIMERGROUP1 : R/W; bitpos: [29:28];
 * default: 3;
 * BackUp access timergroup1 permission.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_TIMERGROUP1    0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_TIMERGROUP1_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_TIMERGROUP1_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_TIMERGROUP1_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_TIMERGROUP1_V  0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_TIMERGROUP1_S  28

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_TIMERGROUP : R/W; bitpos: [27:26];
 * default: 3;
 * BackUp access timergroup permission.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_TIMERGROUP    0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_TIMERGROUP_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_TIMERGROUP_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_TIMERGROUP_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_TIMERGROUP_V  0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_TIMERGROUP_S  26

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_PWM0 : R/W; bitpos: [25:24]; default:
 * 3;
 * BackUp access pwm0 permission.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_PWM0    0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_PWM0_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_PWM0_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_PWM0_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_PWM0_V  0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_PWM0_S  24

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_BB : R/W; bitpos: [23:22]; default: 3;
 * BackUp access bb permission.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_BB    0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_BB_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_BB_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_BB_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_BB_V  0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_BB_S  22

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_BACKUP : R/W; bitpos: [19:18];
 * default: 3;
 * BackUp access backup permission.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_BACKUP    0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_BACKUP_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_BACKUP_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_BACKUP_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_BACKUP_V  0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_BACKUP_S  18

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_LEDC : R/W; bitpos: [17:16]; default:
 * 3;
 * BackUp access ledc permission.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_LEDC    0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_LEDC_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_LEDC_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_LEDC_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_LEDC_V  0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_LEDC_S  16

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_SLC : R/W; bitpos: [15:14]; default: 3;
 * BackUp access slc permission.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_SLC    0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_SLC_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_SLC_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_SLC_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_SLC_V  0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_SLC_S  14

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_PCNT : R/W; bitpos: [13:12]; default:
 * 3;
 * BackUp access pcnt permission.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_PCNT    0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_PCNT_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_PCNT_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_PCNT_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_PCNT_V  0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_PCNT_S  12

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_RMT : R/W; bitpos: [11:10]; default: 3;
 * BackUp access rmt permission.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_RMT    0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_RMT_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_RMT_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_RMT_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_RMT_V  0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_RMT_S  10

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_SLCHOST : R/W; bitpos: [9:8]; default:
 * 3;
 * BackUp access slchost permission.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_SLCHOST    0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_SLCHOST_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_SLCHOST_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_SLCHOST_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_SLCHOST_V  0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_SLCHOST_S  8

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_UHCI0 : R/W; bitpos: [7:6]; default: 3;
 * BackUp access uhci0 permission.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_UHCI0    0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_UHCI0_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_UHCI0_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_UHCI0_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_UHCI0_V  0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_UHCI0_S  6

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_I2C_EXT0 : R/W; bitpos: [5:4];
 * default: 3;
 * BackUp access i2c_ext0 permission.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_I2C_EXT0    0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_I2C_EXT0_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_I2C_EXT0_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_I2C_EXT0_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_I2C_EXT0_V  0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_I2C_EXT0_S  4

