apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_sensitive.h
/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_BT : R/W; bitpos: [1:0]; default: 3;
 * BackUp access bt permission.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_BT    0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_BT_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_BT_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_BT_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_BT_V  0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_BT_S  0

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_3_REG register
 * BackUp access peripherals permission configuration register 3.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_3_REG (DR_REG_SENSITIVE_BASE + 0x288)

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_PWR : R/W; bitpos: [29:28]; default: 3;
 * BackUp access pwr permission.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_PWR    0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_PWR_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_PWR_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_PWR_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_PWR_V  0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_PWR_S  28

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_WIFIMAC : R/W; bitpos: [27:26];
 * default: 3;
 * BackUp access wifimac permission.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_WIFIMAC    0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_WIFIMAC_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_WIFIMAC_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_WIFIMAC_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_WIFIMAC_V  0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_WIFIMAC_S  26

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_RWBT : R/W; bitpos: [23:22]; default:
 * 3;
 * BackUp access rwbt permission.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_RWBT    0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_RWBT_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_RWBT_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_RWBT_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_RWBT_V  0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_RWBT_S  22

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_UART2 : R/W; bitpos: [17:16]; default:
 * 3;
 * BackUp access uart2 permission.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_UART2    0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_UART2_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_UART2_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_UART2_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_UART2_V  0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_UART2_S  16

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_I2S1 : R/W; bitpos: [15:14]; default:
 * 3;
 * BackUp access i2s1 permission.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_I2S1    0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_I2S1_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_I2S1_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_I2S1_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_I2S1_V  0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_I2S1_S  14

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_PWM1 : R/W; bitpos: [13:12]; default:
 * 3;
 * BackUp access pwm1 permission.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_PWM1    0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_PWM1_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_PWM1_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_PWM1_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_PWM1_V  0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_PWM1_S  12

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_CAN : R/W; bitpos: [11:10]; default: 3;
 * BackUp access can permission.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_CAN    0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_CAN_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_CAN_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_CAN_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_CAN_V  0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_CAN_S  10

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_SDIO_HOST : R/W; bitpos: [9:8];
 * default: 3;
 * BackUp access sdio_host permission.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_SDIO_HOST    0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_SDIO_HOST_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_SDIO_HOST_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_SDIO_HOST_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_SDIO_HOST_V  0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_SDIO_HOST_S  8

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_I2C_EXT1 : R/W; bitpos: [7:6];
 * default: 3;
 * BackUp access i2c_ext1 permission.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_I2C_EXT1    0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_I2C_EXT1_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_I2C_EXT1_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_I2C_EXT1_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_I2C_EXT1_V  0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_I2C_EXT1_S  6

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_APB_CTRL : R/W; bitpos: [5:4];
 * default: 3;
 * BackUp access apb_ctrl permission.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_APB_CTRL    0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_APB_CTRL_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_APB_CTRL_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_APB_CTRL_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_APB_CTRL_V  0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_APB_CTRL_S  4

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_SPI_3 : R/W; bitpos: [3:2]; default: 3;
 * BackUp access spi_3 permission.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_SPI_3    0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_SPI_3_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_SPI_3_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_SPI_3_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_SPI_3_V  0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_SPI_3_S  2

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_SPI_2 : R/W; bitpos: [1:0]; default: 3;
 * BackUp access spi_2 permission.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_SPI_2    0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_SPI_2_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_SPI_2_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_SPI_2_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_SPI_2_V  0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_SPI_2_S  0

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_4_REG register
 * BackUp access peripherals permission configuration register 4.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_4_REG (DR_REG_SENSITIVE_BASE + 0x28c)

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_WORLD_CONTROLLER : R/W; bitpos:
 * [31:30]; default: 3;
 * BackUp access world_controller permission.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_WORLD_CONTROLLER    0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_WORLD_CONTROLLER_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_WORLD_CONTROLLER_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_WORLD_CONTROLLER_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_WORLD_CONTROLLER_V  0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_WORLD_CONTROLLER_S  30

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_DIO : R/W; bitpos: [29:28]; default: 3;
 * BackUp access dio permission.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_DIO    0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_DIO_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_DIO_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_DIO_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_DIO_V  0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_DIO_S  28

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_AD : R/W; bitpos: [27:26]; default: 3;
 * BackUp access ad permission.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_AD    0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_AD_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_AD_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_AD_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_AD_V  0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_AD_S  26

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_CACHE_CONFIG : R/W; bitpos: [25:24];
 * default: 3;
 * BackUp access cache_config permission.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_CACHE_CONFIG    0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_CACHE_CONFIG_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_CACHE_CONFIG_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_CACHE_CONFIG_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_CACHE_CONFIG_V  0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_CACHE_CONFIG_S  24

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_DMA_COPY : R/W; bitpos: [23:22];
 * default: 3;
 * BackUp access dma_copy permission.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_DMA_COPY    0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_DMA_COPY_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_DMA_COPY_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_DMA_COPY_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_DMA_COPY_V  0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_DMA_COPY_S  22

