apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_sensitive.h
/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_INTERRUPT : R/W; bitpos: [21:20];
 * default: 3;
 * BackUp access interrupt permission.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_INTERRUPT    0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_INTERRUPT_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_INTERRUPT_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_INTERRUPT_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_INTERRUPT_V  0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_INTERRUPT_S  20

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_SENSITIVE : R/W; bitpos: [19:18];
 * default: 3;
 * BackUp access sensitive permission.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_SENSITIVE    0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_SENSITIVE_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_SENSITIVE_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_SENSITIVE_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_SENSITIVE_V  0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_SENSITIVE_S  18

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_SYSTEM : R/W; bitpos: [17:16];
 * default: 3;
 * BackUp access system permission.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_SYSTEM    0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_SYSTEM_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_SYSTEM_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_SYSTEM_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_SYSTEM_V  0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_SYSTEM_S  16

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_USB : R/W; bitpos: [15:14]; default: 3;
 * BackUp access usb permission.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_USB    0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_USB_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_USB_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_USB_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_USB_V  0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_USB_S  14

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_BT_PWR : R/W; bitpos: [13:12];
 * default: 3;
 * BackUp access bt_pwr permission.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_BT_PWR    0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_BT_PWR_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_BT_PWR_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_BT_PWR_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_BT_PWR_V  0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_BT_PWR_S  12

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_LCD_CAM : R/W; bitpos: [11:10];
 * default: 3;
 * BackUp access lcd_cam permission.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_LCD_CAM    0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_LCD_CAM_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_LCD_CAM_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_LCD_CAM_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_LCD_CAM_V  0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_LCD_CAM_S  10

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_APB_ADC : R/W; bitpos: [9:8]; default:
 * 3;
 * BackUp access apb_adc permission.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_APB_ADC    0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_APB_ADC_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_APB_ADC_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_APB_ADC_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_APB_ADC_V  0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_APB_ADC_S  8

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_CRYPTO_DMA : R/W; bitpos: [7:6];
 * default: 3;
 * BackUp access crypto_dma permission.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_CRYPTO_DMA    0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_CRYPTO_DMA_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_CRYPTO_DMA_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_CRYPTO_DMA_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_CRYPTO_DMA_V  0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_CRYPTO_DMA_S  6

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_CRYPTO_PERI : R/W; bitpos: [5:4];
 * default: 3;
 * BackUp access crypto_peri permission.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_CRYPTO_PERI    0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_CRYPTO_PERI_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_CRYPTO_PERI_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_CRYPTO_PERI_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_CRYPTO_PERI_V  0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_CRYPTO_PERI_S  4

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_USB_WRAP : R/W; bitpos: [3:2];
 * default: 3;
 * BackUp access usb_wrap permission.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_USB_WRAP    0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_USB_WRAP_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_USB_WRAP_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_USB_WRAP_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_USB_WRAP_V  0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_USB_WRAP_S  2

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_USB_DEVICE : R/W; bitpos: [1:0];
 * default: 3;
 * BackUp access usb_device permission.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_USB_DEVICE    0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_USB_DEVICE_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_USB_DEVICE_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_USB_DEVICE_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_USB_DEVICE_V  0x00000003
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_USB_DEVICE_S  0

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_5_REG register
 * BackUp access peripherals permission configuration register 5.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_5_REG (DR_REG_SENSITIVE_BASE + 0x290)

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_RTCFAST_SPLTADDR : R/W; bitpos:
 * [10:0]; default: 2047;
 * BackUp access rtcfast_spltaddr permission.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_RTCFAST_SPLTADDR    0x000007ff
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_RTCFAST_SPLTADDR_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_RTCFAST_SPLTADDR_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_RTCFAST_SPLTADDR_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_RTCFAST_SPLTADDR_V  0x000007ff
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_RTCFAST_SPLTADDR_S  0

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_6_REG register
 * BackUp access peripherals permission configuration register 6.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_6_REG (DR_REG_SENSITIVE_BASE + 0x294)

/* SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_RTCFAST_H : R/W; bitpos: [5:3];
 * default: 7;
 * BackUp access rtcfast_h permission.
 */

#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_RTCFAST_H    0x00000007
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_RTCFAST_H_M  (SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_RTCFAST_H_V << SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_RTCFAST_H_S)
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_RTCFAST_H_V  0x00000007
#define SENSITIVE_BACKUP_BUS_PMS_CONSTRAIN_RTCFAST_H_S  3

