apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_sensitive.h
#define SENSITIVE_EDMA_BOUNDARY_0    0x00003fff
#define SENSITIVE_EDMA_BOUNDARY_0_M  (SENSITIVE_EDMA_BOUNDARY_0_V << SENSITIVE_EDMA_BOUNDARY_0_S)
#define SENSITIVE_EDMA_BOUNDARY_0_V  0x00003fff
#define SENSITIVE_EDMA_BOUNDARY_0_S  0

/* SENSITIVE_EDMA_BOUNDARY_1_REG register
 * EDMA boundary 1 configuration
 */

#define SENSITIVE_EDMA_BOUNDARY_1_REG (DR_REG_SENSITIVE_BASE + 0x2b0)

/* SENSITIVE_EDMA_BOUNDARY_1 : R/W; bitpos: [13:0]; default: 8192;
 * This field is used to configure the boundary 1 of external RAM. The unit
 * is 4K. For example, set this field to 0x80, then the address boundary 0
 * would be 0x3C080000 (0x3C000000 + 0x80 * 4K).
 */

#define SENSITIVE_EDMA_BOUNDARY_1    0x00003fff
#define SENSITIVE_EDMA_BOUNDARY_1_M  (SENSITIVE_EDMA_BOUNDARY_1_V << SENSITIVE_EDMA_BOUNDARY_1_S)
#define SENSITIVE_EDMA_BOUNDARY_1_V  0x00003fff
#define SENSITIVE_EDMA_BOUNDARY_1_S  0

/* SENSITIVE_EDMA_BOUNDARY_2_REG register
 * EDMA boundary 2 configuration
 */

#define SENSITIVE_EDMA_BOUNDARY_2_REG (DR_REG_SENSITIVE_BASE + 0x2b4)

/* SENSITIVE_EDMA_BOUNDARY_2 : R/W; bitpos: [13:0]; default: 8192;
 * This field is used to configure the boundary 2 of external RAM. The unit
 * is 4K. For example, set this field to 0x80, then the address boundary 0
 * would be 0x3C080000 (0x3C000000 + 0x80 * 4K).
 */

#define SENSITIVE_EDMA_BOUNDARY_2    0x00003fff
#define SENSITIVE_EDMA_BOUNDARY_2_M  (SENSITIVE_EDMA_BOUNDARY_2_V << SENSITIVE_EDMA_BOUNDARY_2_S)
#define SENSITIVE_EDMA_BOUNDARY_2_V  0x00003fff
#define SENSITIVE_EDMA_BOUNDARY_2_S  0

/* SENSITIVE_EDMA_PMS_SPI2_LOCK_REG register
 * EDMA-SPI2 permission lock register.
 */

#define SENSITIVE_EDMA_PMS_SPI2_LOCK_REG (DR_REG_SENSITIVE_BASE + 0x2b8)

/* SENSITIVE_EDMA_PMS_SPI2_LOCK : R/W; bitpos: [0]; default: 0;
 * Set 1 to lock EDMA-SPI2 permission control registers.
 */

#define SENSITIVE_EDMA_PMS_SPI2_LOCK    (BIT(0))
#define SENSITIVE_EDMA_PMS_SPI2_LOCK_M  (SENSITIVE_EDMA_PMS_SPI2_LOCK_V << SENSITIVE_EDMA_PMS_SPI2_LOCK_S)
#define SENSITIVE_EDMA_PMS_SPI2_LOCK_V  0x00000001
#define SENSITIVE_EDMA_PMS_SPI2_LOCK_S  0

/* SENSITIVE_EDMA_PMS_SPI2_REG register
 * EDMA-SPI2 permission control register.
 */

#define SENSITIVE_EDMA_PMS_SPI2_REG (DR_REG_SENSITIVE_BASE + 0x2bc)

/* SENSITIVE_EDMA_PMS_SPI2_ATTR2 : R/W; bitpos: [3:2]; default: 3;
 * This field is used to configure the permission of SPI2 accessing address,
 * which is larger than boundary 1 and less than boundary 2, through EDMA.
 * Bit 0: set this bit to enable read permission. Bit 1: set this bit to
 * enable write permission.
 */

#define SENSITIVE_EDMA_PMS_SPI2_ATTR2    0x00000003
#define SENSITIVE_EDMA_PMS_SPI2_ATTR2_M  (SENSITIVE_EDMA_PMS_SPI2_ATTR2_V << SENSITIVE_EDMA_PMS_SPI2_ATTR2_S)
#define SENSITIVE_EDMA_PMS_SPI2_ATTR2_V  0x00000003
#define SENSITIVE_EDMA_PMS_SPI2_ATTR2_S  2

/* SENSITIVE_EDMA_PMS_SPI2_ATTR1 : R/W; bitpos: [1:0]; default: 3;
 * This field is used to configure the permission of SPI2 accessing address,
 * which is larger than boundary 0 and less than boundary 1, through EDMA.
 * Bit 0: set this bit to enable read permission. Bit 1: set this bit to
 * enable write permission.
 */

#define SENSITIVE_EDMA_PMS_SPI2_ATTR1    0x00000003
#define SENSITIVE_EDMA_PMS_SPI2_ATTR1_M  (SENSITIVE_EDMA_PMS_SPI2_ATTR1_V << SENSITIVE_EDMA_PMS_SPI2_ATTR1_S)
#define SENSITIVE_EDMA_PMS_SPI2_ATTR1_V  0x00000003
#define SENSITIVE_EDMA_PMS_SPI2_ATTR1_S  0

/* SENSITIVE_EDMA_PMS_SPI3_LOCK_REG register
 * EDMA-SPI3 permission lock register.
 */

#define SENSITIVE_EDMA_PMS_SPI3_LOCK_REG (DR_REG_SENSITIVE_BASE + 0x2c0)

/* SENSITIVE_EDMA_PMS_SPI3_LOCK : R/W; bitpos: [0]; default: 0;
 * Set 1 to lock EDMA-SPI3 permission control registers.
 */

#define SENSITIVE_EDMA_PMS_SPI3_LOCK    (BIT(0))
#define SENSITIVE_EDMA_PMS_SPI3_LOCK_M  (SENSITIVE_EDMA_PMS_SPI3_LOCK_V << SENSITIVE_EDMA_PMS_SPI3_LOCK_S)
#define SENSITIVE_EDMA_PMS_SPI3_LOCK_V  0x00000001
#define SENSITIVE_EDMA_PMS_SPI3_LOCK_S  0

/* SENSITIVE_EDMA_PMS_SPI3_REG register
 * EDMA-SPI3 permission control register.
 */

#define SENSITIVE_EDMA_PMS_SPI3_REG (DR_REG_SENSITIVE_BASE + 0x2c4)

/* SENSITIVE_EDMA_PMS_SPI3_ATTR2 : R/W; bitpos: [3:2]; default: 3;
 * This field is used to configure the permission of SPI3 accessing address,
 * which is larger than boundary 1 and less than boundary 2, through EDMA.
 * Bit 0: set this bit to enable read permission. Bit 1: set this bit to
 * enable write permission.
 */

#define SENSITIVE_EDMA_PMS_SPI3_ATTR2    0x00000003
#define SENSITIVE_EDMA_PMS_SPI3_ATTR2_M  (SENSITIVE_EDMA_PMS_SPI3_ATTR2_V << SENSITIVE_EDMA_PMS_SPI3_ATTR2_S)
#define SENSITIVE_EDMA_PMS_SPI3_ATTR2_V  0x00000003
#define SENSITIVE_EDMA_PMS_SPI3_ATTR2_S  2

/* SENSITIVE_EDMA_PMS_SPI3_ATTR1 : R/W; bitpos: [1:0]; default: 3;
 * This field is used to configure the permission of SPI3 accessing address,
 * which is larger than boundary 0 and less than boundary 1, through EDMA.
 * Bit 0: set this bit to enable read permission. Bit 1: set this bit to
 * enable write permission.
 */

#define SENSITIVE_EDMA_PMS_SPI3_ATTR1    0x00000003
#define SENSITIVE_EDMA_PMS_SPI3_ATTR1_M  (SENSITIVE_EDMA_PMS_SPI3_ATTR1_V << SENSITIVE_EDMA_PMS_SPI3_ATTR1_S)
#define SENSITIVE_EDMA_PMS_SPI3_ATTR1_V  0x00000003
#define SENSITIVE_EDMA_PMS_SPI3_ATTR1_S  0

/* SENSITIVE_EDMA_PMS_UHCI0_LOCK_REG register
 * EDMA-UHCI0 permission lock register.
 */

#define SENSITIVE_EDMA_PMS_UHCI0_LOCK_REG (DR_REG_SENSITIVE_BASE + 0x2c8)

/* SENSITIVE_EDMA_PMS_UHCI0_LOCK : R/W; bitpos: [0]; default: 0;
 * Set 1 to lock EDMA-UHCI0 permission control registers.
 */

#define SENSITIVE_EDMA_PMS_UHCI0_LOCK    (BIT(0))
#define SENSITIVE_EDMA_PMS_UHCI0_LOCK_M  (SENSITIVE_EDMA_PMS_UHCI0_LOCK_V << SENSITIVE_EDMA_PMS_UHCI0_LOCK_S)
#define SENSITIVE_EDMA_PMS_UHCI0_LOCK_V  0x00000001
#define SENSITIVE_EDMA_PMS_UHCI0_LOCK_S  0

/* SENSITIVE_EDMA_PMS_UHCI0_REG register
 * EDMA-UHCI0 permission control register.
 */

#define SENSITIVE_EDMA_PMS_UHCI0_REG (DR_REG_SENSITIVE_BASE + 0x2cc)

/* SENSITIVE_EDMA_PMS_UHCI0_ATTR2 : R/W; bitpos: [3:2]; default: 3;
 * This field is used to configure the permission of UHCI0 accessing
 * address, which is larger than boundary 1 and less than boundary 2,
 * through EDMA. Bit 0: set this bit to enable read permission. Bit 1: set
 * this bit to enable write permission.
 */

#define SENSITIVE_EDMA_PMS_UHCI0_ATTR2    0x00000003
#define SENSITIVE_EDMA_PMS_UHCI0_ATTR2_M  (SENSITIVE_EDMA_PMS_UHCI0_ATTR2_V << SENSITIVE_EDMA_PMS_UHCI0_ATTR2_S)
#define SENSITIVE_EDMA_PMS_UHCI0_ATTR2_V  0x00000003
#define SENSITIVE_EDMA_PMS_UHCI0_ATTR2_S  2

/* SENSITIVE_EDMA_PMS_UHCI0_ATTR1 : R/W; bitpos: [1:0]; default: 3;
 * This field is used to configure the permission of UHCI0 accessing
 * address, which is larger than boundary 0 and less than boundary 1,
 * through EDMA. Bit 0: set this bit to enable read permission. Bit 1: set
 * this bit to enable write permission.
 */

