apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_sensitive.h
#define SENSITIVE_EDMA_PMS_UHCI0_ATTR1    0x00000003
#define SENSITIVE_EDMA_PMS_UHCI0_ATTR1_M  (SENSITIVE_EDMA_PMS_UHCI0_ATTR1_V << SENSITIVE_EDMA_PMS_UHCI0_ATTR1_S)
#define SENSITIVE_EDMA_PMS_UHCI0_ATTR1_V  0x00000003
#define SENSITIVE_EDMA_PMS_UHCI0_ATTR1_S  0

/* SENSITIVE_EDMA_PMS_I2S0_LOCK_REG register
 * EDMA-I2S0 permission lock register.
 */

#define SENSITIVE_EDMA_PMS_I2S0_LOCK_REG (DR_REG_SENSITIVE_BASE + 0x2d0)

/* SENSITIVE_EDMA_PMS_I2S0_LOCK : R/W; bitpos: [0]; default: 0;
 * Set 1 to lock EDMA-I2S0 permission control registers.
 */

#define SENSITIVE_EDMA_PMS_I2S0_LOCK    (BIT(0))
#define SENSITIVE_EDMA_PMS_I2S0_LOCK_M  (SENSITIVE_EDMA_PMS_I2S0_LOCK_V << SENSITIVE_EDMA_PMS_I2S0_LOCK_S)
#define SENSITIVE_EDMA_PMS_I2S0_LOCK_V  0x00000001
#define SENSITIVE_EDMA_PMS_I2S0_LOCK_S  0

/* SENSITIVE_EDMA_PMS_I2S0_REG register
 * EDMA-I2S0 permission control register.
 */

#define SENSITIVE_EDMA_PMS_I2S0_REG (DR_REG_SENSITIVE_BASE + 0x2d4)

/* SENSITIVE_EDMA_PMS_I2S0_ATTR2 : R/W; bitpos: [3:2]; default: 3;
 * This field is used to configure the permission of I2S0 accessing address,
 * which is larger than boundary 1 and less than boundary 2, through EDMA.
 * Bit 0: set this bit to enable read permission. Bit 1: set this bit to
 * enable write permission.
 */

#define SENSITIVE_EDMA_PMS_I2S0_ATTR2    0x00000003
#define SENSITIVE_EDMA_PMS_I2S0_ATTR2_M  (SENSITIVE_EDMA_PMS_I2S0_ATTR2_V << SENSITIVE_EDMA_PMS_I2S0_ATTR2_S)
#define SENSITIVE_EDMA_PMS_I2S0_ATTR2_V  0x00000003
#define SENSITIVE_EDMA_PMS_I2S0_ATTR2_S  2

/* SENSITIVE_EDMA_PMS_I2S0_ATTR1 : R/W; bitpos: [1:0]; default: 3;
 * This field is used to configure the permission of I2S0 accessing address,
 * which is larger than boundary 0 and less than boundary 1, through EDMA.
 * Bit 0: set this bit to enable read permission. Bit 1: set this bit to
 * enable write permission.
 */

#define SENSITIVE_EDMA_PMS_I2S0_ATTR1    0x00000003
#define SENSITIVE_EDMA_PMS_I2S0_ATTR1_M  (SENSITIVE_EDMA_PMS_I2S0_ATTR1_V << SENSITIVE_EDMA_PMS_I2S0_ATTR1_S)
#define SENSITIVE_EDMA_PMS_I2S0_ATTR1_V  0x00000003
#define SENSITIVE_EDMA_PMS_I2S0_ATTR1_S  0

/* SENSITIVE_EDMA_PMS_I2S1_LOCK_REG register
 * EDMA-I2S1 permission lock register.
 */

#define SENSITIVE_EDMA_PMS_I2S1_LOCK_REG (DR_REG_SENSITIVE_BASE + 0x2d8)

/* SENSITIVE_EDMA_PMS_I2S1_LOCK : R/W; bitpos: [0]; default: 0;
 * Set 1 to lock EDMA-I2S1 permission control registers.
 */

#define SENSITIVE_EDMA_PMS_I2S1_LOCK    (BIT(0))
#define SENSITIVE_EDMA_PMS_I2S1_LOCK_M  (SENSITIVE_EDMA_PMS_I2S1_LOCK_V << SENSITIVE_EDMA_PMS_I2S1_LOCK_S)
#define SENSITIVE_EDMA_PMS_I2S1_LOCK_V  0x00000001
#define SENSITIVE_EDMA_PMS_I2S1_LOCK_S  0

/* SENSITIVE_EDMA_PMS_I2S1_REG register
 * EDMA-I2S1 permission control register.
 */

#define SENSITIVE_EDMA_PMS_I2S1_REG (DR_REG_SENSITIVE_BASE + 0x2dc)

/* SENSITIVE_EDMA_PMS_I2S1_ATTR2 : R/W; bitpos: [3:2]; default: 3;
 * This field is used to configure the permission of I2S1 accessing address,
 * which is larger than boundary 1 and less than boundary 2, through EDMA.
 * Bit 0: set this bit to enable read permission. Bit 1: set this bit to
 * enable write permission.
 */

#define SENSITIVE_EDMA_PMS_I2S1_ATTR2    0x00000003
#define SENSITIVE_EDMA_PMS_I2S1_ATTR2_M  (SENSITIVE_EDMA_PMS_I2S1_ATTR2_V << SENSITIVE_EDMA_PMS_I2S1_ATTR2_S)
#define SENSITIVE_EDMA_PMS_I2S1_ATTR2_V  0x00000003
#define SENSITIVE_EDMA_PMS_I2S1_ATTR2_S  2

/* SENSITIVE_EDMA_PMS_I2S1_ATTR1 : R/W; bitpos: [1:0]; default: 3;
 * This field is used to configure the permission of I2S1 accessing address,
 * which is larger than boundary 0 and less than boundary 1, through EDMA.
 * Bit 0: set this bit to enable read permission. Bit 1: set this bit to
 * enable write permission.
 */

#define SENSITIVE_EDMA_PMS_I2S1_ATTR1    0x00000003
#define SENSITIVE_EDMA_PMS_I2S1_ATTR1_M  (SENSITIVE_EDMA_PMS_I2S1_ATTR1_V << SENSITIVE_EDMA_PMS_I2S1_ATTR1_S)
#define SENSITIVE_EDMA_PMS_I2S1_ATTR1_V  0x00000003
#define SENSITIVE_EDMA_PMS_I2S1_ATTR1_S  0

/* SENSITIVE_EDMA_PMS_LCD_CAM_LOCK_REG register
 * EDMA-LCD/CAM permission lock register.
 */

#define SENSITIVE_EDMA_PMS_LCD_CAM_LOCK_REG (DR_REG_SENSITIVE_BASE + 0x2e0)

/* SENSITIVE_EDMA_PMS_LCD_CAM_LOCK : R/W; bitpos: [0]; default: 0;
 * Set 1 to lock EDMA-LCD/CAM permission control registers.
 */

#define SENSITIVE_EDMA_PMS_LCD_CAM_LOCK    (BIT(0))
#define SENSITIVE_EDMA_PMS_LCD_CAM_LOCK_M  (SENSITIVE_EDMA_PMS_LCD_CAM_LOCK_V << SENSITIVE_EDMA_PMS_LCD_CAM_LOCK_S)
#define SENSITIVE_EDMA_PMS_LCD_CAM_LOCK_V  0x00000001
#define SENSITIVE_EDMA_PMS_LCD_CAM_LOCK_S  0

/* SENSITIVE_EDMA_PMS_LCD_CAM_REG register
 * EDMA-LCD/CAM permission control register.
 */

#define SENSITIVE_EDMA_PMS_LCD_CAM_REG (DR_REG_SENSITIVE_BASE + 0x2e4)

/* SENSITIVE_EDMA_PMS_LCD_CAM_ATTR2 : R/W; bitpos: [3:2]; default: 3;
 * This field is used to configure the permission of LCD/CAM accessing
 * address, which is larger than boundary 1 and less than boundary 2,
 * through EDMA. Bit 0: set this bit to enable read permission. Bit 1: set
 * this bit to enable write permission.
 */

#define SENSITIVE_EDMA_PMS_LCD_CAM_ATTR2    0x00000003
#define SENSITIVE_EDMA_PMS_LCD_CAM_ATTR2_M  (SENSITIVE_EDMA_PMS_LCD_CAM_ATTR2_V << SENSITIVE_EDMA_PMS_LCD_CAM_ATTR2_S)
#define SENSITIVE_EDMA_PMS_LCD_CAM_ATTR2_V  0x00000003
#define SENSITIVE_EDMA_PMS_LCD_CAM_ATTR2_S  2

/* SENSITIVE_EDMA_PMS_LCD_CAM_ATTR1 : R/W; bitpos: [1:0]; default: 3;
 * This field is used to configure the permission of LCD/CAM accessing
 * address, which is larger than boundary 0 and less than boundary 1,
 * through EDMA. Bit 0: set this bit to enable read permission. Bit 1: set
 * this bit to enable write permission.
 */

#define SENSITIVE_EDMA_PMS_LCD_CAM_ATTR1    0x00000003
#define SENSITIVE_EDMA_PMS_LCD_CAM_ATTR1_M  (SENSITIVE_EDMA_PMS_LCD_CAM_ATTR1_V << SENSITIVE_EDMA_PMS_LCD_CAM_ATTR1_S)
#define SENSITIVE_EDMA_PMS_LCD_CAM_ATTR1_V  0x00000003
#define SENSITIVE_EDMA_PMS_LCD_CAM_ATTR1_S  0

/* SENSITIVE_EDMA_PMS_AES_LOCK_REG register
 * EDMA-AES permission lock register.
 */

