apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_sensitive.h
#define SENSITIVE_EDMA_PMS_AES_LOCK_REG (DR_REG_SENSITIVE_BASE + 0x2e8)

/* SENSITIVE_EDMA_PMS_AES_LOCK : R/W; bitpos: [0]; default: 0;
 * Set 1 to lock EDMA-AES permission control registers.
 */

#define SENSITIVE_EDMA_PMS_AES_LOCK    (BIT(0))
#define SENSITIVE_EDMA_PMS_AES_LOCK_M  (SENSITIVE_EDMA_PMS_AES_LOCK_V << SENSITIVE_EDMA_PMS_AES_LOCK_S)
#define SENSITIVE_EDMA_PMS_AES_LOCK_V  0x00000001
#define SENSITIVE_EDMA_PMS_AES_LOCK_S  0

/* SENSITIVE_EDMA_PMS_AES_REG register
 * EDMA-AES permission control register.
 */

#define SENSITIVE_EDMA_PMS_AES_REG (DR_REG_SENSITIVE_BASE + 0x2ec)

/* SENSITIVE_EDMA_PMS_AES_ATTR2 : R/W; bitpos: [3:2]; default: 3;
 * This field is used to configure the permission of AES accessing address,
 * which is larger than boundary 1 and less than boundary 2, through EDMA.
 * Bit 0: set this bit to enable read permission. Bit 1: set this bit to
 * enable write permission.
 */

#define SENSITIVE_EDMA_PMS_AES_ATTR2    0x00000003
#define SENSITIVE_EDMA_PMS_AES_ATTR2_M  (SENSITIVE_EDMA_PMS_AES_ATTR2_V << SENSITIVE_EDMA_PMS_AES_ATTR2_S)
#define SENSITIVE_EDMA_PMS_AES_ATTR2_V  0x00000003
#define SENSITIVE_EDMA_PMS_AES_ATTR2_S  2

/* SENSITIVE_EDMA_PMS_AES_ATTR1 : R/W; bitpos: [1:0]; default: 3;
 * This field is used to configure the permission of AES accessing address,
 * which is larger than boundary 0 and less than boundary 1, through EDMA.
 * Bit 0: set this bit to enable read permission. Bit 1: set this bit to
 * enable write permission.
 */

#define SENSITIVE_EDMA_PMS_AES_ATTR1    0x00000003
#define SENSITIVE_EDMA_PMS_AES_ATTR1_M  (SENSITIVE_EDMA_PMS_AES_ATTR1_V << SENSITIVE_EDMA_PMS_AES_ATTR1_S)
#define SENSITIVE_EDMA_PMS_AES_ATTR1_V  0x00000003
#define SENSITIVE_EDMA_PMS_AES_ATTR1_S  0

/* SENSITIVE_EDMA_PMS_SHA_LOCK_REG register
 * EDMA-SHA permission lock register.
 */

#define SENSITIVE_EDMA_PMS_SHA_LOCK_REG (DR_REG_SENSITIVE_BASE + 0x2f0)

/* SENSITIVE_EDMA_PMS_SHA_LOCK : R/W; bitpos: [0]; default: 0;
 * Set 1 to lock EDMA-SHA permission control registers.
 */

#define SENSITIVE_EDMA_PMS_SHA_LOCK    (BIT(0))
#define SENSITIVE_EDMA_PMS_SHA_LOCK_M  (SENSITIVE_EDMA_PMS_SHA_LOCK_V << SENSITIVE_EDMA_PMS_SHA_LOCK_S)
#define SENSITIVE_EDMA_PMS_SHA_LOCK_V  0x00000001
#define SENSITIVE_EDMA_PMS_SHA_LOCK_S  0

/* SENSITIVE_EDMA_PMS_SHA_REG register
 * EDMA-SHA permission control register.
 */

#define SENSITIVE_EDMA_PMS_SHA_REG (DR_REG_SENSITIVE_BASE + 0x2f4)

/* SENSITIVE_EDMA_PMS_SHA_ATTR2 : R/W; bitpos: [3:2]; default: 3;
 * This field is used to configure the permission of SHA accessing address,
 * which is larger than boundary 1 and less than boundary 2, through EDMA.
 * Bit 0: set this bit to enable read permission. Bit 1: set this bit to
 * enable write permission.
 */

#define SENSITIVE_EDMA_PMS_SHA_ATTR2    0x00000003
#define SENSITIVE_EDMA_PMS_SHA_ATTR2_M  (SENSITIVE_EDMA_PMS_SHA_ATTR2_V << SENSITIVE_EDMA_PMS_SHA_ATTR2_S)
#define SENSITIVE_EDMA_PMS_SHA_ATTR2_V  0x00000003
#define SENSITIVE_EDMA_PMS_SHA_ATTR2_S  2

/* SENSITIVE_EDMA_PMS_SHA_ATTR1 : R/W; bitpos: [1:0]; default: 3;
 * This field is used to configure the permission of SHA accessing address,
 * which is larger than boundary 0 and less than boundary 1, through EDMA.
 * Bit 0: set this bit to enable read permission. Bit 1: set this bit to
 * enable write permission.
 */

#define SENSITIVE_EDMA_PMS_SHA_ATTR1    0x00000003
#define SENSITIVE_EDMA_PMS_SHA_ATTR1_M  (SENSITIVE_EDMA_PMS_SHA_ATTR1_V << SENSITIVE_EDMA_PMS_SHA_ATTR1_S)
#define SENSITIVE_EDMA_PMS_SHA_ATTR1_V  0x00000003
#define SENSITIVE_EDMA_PMS_SHA_ATTR1_S  0

/* SENSITIVE_EDMA_PMS_ADC_DAC_LOCK_REG register
 * EDMA-ADC/DAC permission lock register.
 */

#define SENSITIVE_EDMA_PMS_ADC_DAC_LOCK_REG (DR_REG_SENSITIVE_BASE + 0x2f8)

/* SENSITIVE_EDMA_PMS_ADC_DAC_LOCK : R/W; bitpos: [0]; default: 0;
 * Set 1 to lock EDMA-ADC/DAC permission control registers.
 */

#define SENSITIVE_EDMA_PMS_ADC_DAC_LOCK    (BIT(0))
#define SENSITIVE_EDMA_PMS_ADC_DAC_LOCK_M  (SENSITIVE_EDMA_PMS_ADC_DAC_LOCK_V << SENSITIVE_EDMA_PMS_ADC_DAC_LOCK_S)
#define SENSITIVE_EDMA_PMS_ADC_DAC_LOCK_V  0x00000001
#define SENSITIVE_EDMA_PMS_ADC_DAC_LOCK_S  0

/* SENSITIVE_EDMA_PMS_ADC_DAC_REG register
 * EDMA-ADC/DAC permission control register.
 */

#define SENSITIVE_EDMA_PMS_ADC_DAC_REG (DR_REG_SENSITIVE_BASE + 0x2fc)

/* SENSITIVE_EDMA_PMS_ADC_DAC_ATTR2 : R/W; bitpos: [3:2]; default: 3;
 * This field is used to configure the permission of ADC/DAC accessing
 * address, which is larger than boundary 1 and less than boundary 2,
 * through EDMA. Bit 0: set this bit to enable read permission. Bit 1: set
 * this bit to enable write permission.
 */

#define SENSITIVE_EDMA_PMS_ADC_DAC_ATTR2    0x00000003
#define SENSITIVE_EDMA_PMS_ADC_DAC_ATTR2_M  (SENSITIVE_EDMA_PMS_ADC_DAC_ATTR2_V << SENSITIVE_EDMA_PMS_ADC_DAC_ATTR2_S)
#define SENSITIVE_EDMA_PMS_ADC_DAC_ATTR2_V  0x00000003
#define SENSITIVE_EDMA_PMS_ADC_DAC_ATTR2_S  2

/* SENSITIVE_EDMA_PMS_ADC_DAC_ATTR1 : R/W; bitpos: [1:0]; default: 3;
 * This field is used to configure the permission of ADC/DAC accessing
 * address, which is larger than boundary 0 and less than boundary 1,
 * through EDMA. Bit 0: set this bit to enable read permission. Bit 1: set
 * this bit to enable write permission.
 */

#define SENSITIVE_EDMA_PMS_ADC_DAC_ATTR1    0x00000003
#define SENSITIVE_EDMA_PMS_ADC_DAC_ATTR1_M  (SENSITIVE_EDMA_PMS_ADC_DAC_ATTR1_V << SENSITIVE_EDMA_PMS_ADC_DAC_ATTR1_S)
#define SENSITIVE_EDMA_PMS_ADC_DAC_ATTR1_V  0x00000003
#define SENSITIVE_EDMA_PMS_ADC_DAC_ATTR1_S  0

/* SENSITIVE_EDMA_PMS_RMT_LOCK_REG register
 * EDMA-RMT permission lock register.
 */

#define SENSITIVE_EDMA_PMS_RMT_LOCK_REG (DR_REG_SENSITIVE_BASE + 0x300)

/* SENSITIVE_EDMA_PMS_RMT_LOCK : R/W; bitpos: [0]; default: 0;
 * Set 1 to lock EDMA-RMT permission control registers.
 */

#define SENSITIVE_EDMA_PMS_RMT_LOCK    (BIT(0))
#define SENSITIVE_EDMA_PMS_RMT_LOCK_M  (SENSITIVE_EDMA_PMS_RMT_LOCK_V << SENSITIVE_EDMA_PMS_RMT_LOCK_S)
#define SENSITIVE_EDMA_PMS_RMT_LOCK_V  0x00000001
#define SENSITIVE_EDMA_PMS_RMT_LOCK_S  0

/* SENSITIVE_EDMA_PMS_RMT_REG register
 * EDMA-RMT permission control register.
 */

#define SENSITIVE_EDMA_PMS_RMT_REG (DR_REG_SENSITIVE_BASE + 0x304)

