apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_sensitive.h
/* SENSITIVE_EDMA_PMS_RMT_ATTR2 : R/W; bitpos: [3:2]; default: 3;
 * This field is used to configure the permission of RMT accessing address,
 * which is larger than boundary 1 and less than boundary 2, through EDMA.
 * Bit 0: set this bit to enable read permission. Bit 1: set this bit to
 * enable write permission.
 */

#define SENSITIVE_EDMA_PMS_RMT_ATTR2    0x00000003
#define SENSITIVE_EDMA_PMS_RMT_ATTR2_M  (SENSITIVE_EDMA_PMS_RMT_ATTR2_V << SENSITIVE_EDMA_PMS_RMT_ATTR2_S)
#define SENSITIVE_EDMA_PMS_RMT_ATTR2_V  0x00000003
#define SENSITIVE_EDMA_PMS_RMT_ATTR2_S  2

/* SENSITIVE_EDMA_PMS_RMT_ATTR1 : R/W; bitpos: [1:0]; default: 3;
 * This field is used to configure the permission of RMT accessing address,
 * which is larger than boundary 0 and less than boundary 1, through EDMA.
 * Bit 0: set this bit to enable read permission. Bit 1: set this bit to
 * enable write permission.
 */

#define SENSITIVE_EDMA_PMS_RMT_ATTR1    0x00000003
#define SENSITIVE_EDMA_PMS_RMT_ATTR1_M  (SENSITIVE_EDMA_PMS_RMT_ATTR1_V << SENSITIVE_EDMA_PMS_RMT_ATTR1_S)
#define SENSITIVE_EDMA_PMS_RMT_ATTR1_V  0x00000003
#define SENSITIVE_EDMA_PMS_RMT_ATTR1_S  0

/* SENSITIVE_CLOCK_GATE_REG_REG register
 * Sensitive module clock gate configuration register.
 */

#define SENSITIVE_CLOCK_GATE_REG_REG (DR_REG_SENSITIVE_BASE + 0x308)

/* SENSITIVE_REG_CLK_EN : R/W; bitpos: [0]; default: 1;
 * Set 1 to enable clock gate function.
 */

#define SENSITIVE_REG_CLK_EN    (BIT(0))
#define SENSITIVE_REG_CLK_EN_M  (SENSITIVE_REG_CLK_EN_V << SENSITIVE_REG_CLK_EN_S)
#define SENSITIVE_REG_CLK_EN_V  0x00000001
#define SENSITIVE_REG_CLK_EN_S  0

/* SENSITIVE_RTC_PMS_REG register
 * RTC coprocessor permission register.
 */

#define SENSITIVE_RTC_PMS_REG (DR_REG_SENSITIVE_BASE + 0x30c)

/* SENSITIVE_DIS_RTC_CPU : R/W; bitpos: [0]; default: 0;
 * Set 1 to disable rtc coprocessor.
 */

#define SENSITIVE_DIS_RTC_CPU    (BIT(0))
#define SENSITIVE_DIS_RTC_CPU_M  (SENSITIVE_DIS_RTC_CPU_V << SENSITIVE_DIS_RTC_CPU_S)
#define SENSITIVE_DIS_RTC_CPU_V  0x00000001
#define SENSITIVE_DIS_RTC_CPU_S  0

/* SENSITIVE_DATE_REG register
 * Sensitive version register.
 */

#define SENSITIVE_DATE_REG (DR_REG_SENSITIVE_BASE + 0xffc)

/* SENSITIVE_DATE : R/W; bitpos: [27:0]; default: 34607744;
 * Sensitive Date register.
 */

#define SENSITIVE_DATE    0x0fffffff
#define SENSITIVE_DATE_M  (SENSITIVE_DATE_V << SENSITIVE_DATE_S)
#define SENSITIVE_DATE_V  0x0fffffff
#define SENSITIVE_DATE_S  0

#endif /* __ARCH_XTENSA_SRC_ESP32S3_HARDWARE_ESP32S3_SENSITIVE_H */
